openCSMP/openCSMP/lib/samg/samg2.h
//****************************************************************************************
// file: samg.h
// automatically created by tool make_amgparms_user
// created on (yyyy-mm-dd): 2014-11-20, time: 13:48
//****************************************************************************************

// INTERFACE TO FORTRAN90 SAMG2 : amg subroutines have
// to be called as SAMG2_SAMG when this interface is used
// author: Tanja Clees
// last modified: 2011/10/11 AK

////////////
/* Macros */
////////////

/* subroutine naming conventions.
for Unix / Linux: depending on the names of the Fortran symbols in libamg.a,
   choose one of the following macros via a -D option for the C++ compiler
   in your make.inc (as has already been done in the include files provided!):
      SAMG_LCASE
      SAMG_LCASE_USCORE   (see below what they do)
   if none of the above matches the naming conventions for your system,
   define appropriate macros yourself!
*/

/* SAMG_C_CALLCONV: macro (for Windows!) defining the standard calling convention.
   for Unix / Linux: set -DSAMG_UNIX_LINUX as an option for the C++ compiler
   in your make.inc (as has already been done in the include files provided!) */

/* Applications uses 8 Byte integers */
#ifdef INTEGER_SIZE_64
#ifdef _WIN32
#define APPL_INT __int64
#else
#define APPL_INT long int
#endif
#endif

/* default 4 Byte integer types */
#ifndef APPL_INT
#define APPL_INT int
#endif

#if SAMG_UNIX_LINUX
#define SAMG_C_CALLCONV void
#elif SAMG_CVF
// for Compaq Visual Fortran (tested with 6.6 X) :
#define SAMG_C_CALLCONV void __stdcall
#else
// for Intel Visual Fortran (tested with 8.X) :
#define SAMG_C_CALLCONV void __cdecl
#endif


/////////////////////////////////////
/* directives for subroutine names */
/////////////////////////////////////

#ifdef SAMG_LCASE
#define SAMG2 samg2
#define SAMG2_CTIME samg2_ctime
#define SAMG2_CPUTIME samg2_cputime
#define SAMG2_ELAPSED_TIME samg2_elapsed_time
#define SAMG2_ALL_ERRORINFO samg2_all_errorinfo
#define SAMG2_SIMPLE samg2_simple
#define SAMG2_MAIN samg2_main
#define SAMG2_LEAVE samg2_leave
#define SAMG2_REFRESH samg2_refresh
#define SAMG2_CLEANUP samg2_cleanup
#define SAMG2_RESET_HIDDEN samg2_reset_hidden
#define SAMG2_GET_COMPLEXITIES samg2_get_complexities
#define SAMG2_GET_NFLAG samg2_get_nflag
#define SAMG2_SET_NFLAG samg2_set_nflag
#define SAMG2_GET_NFLAGO samg2_get_nflago
#define SAMG2_SET_NFLAGO samg2_set_nflago
#define SAMG2_GET_NFLAGP samg2_get_nflagp
#define SAMG2_SET_NFLAGP samg2_set_nflagp
#define SAMG2_GET_NFLAGS samg2_get_nflags
#define SAMG2_SET_NFLAGS samg2_set_nflags
#define SAMG2_GET_LEVELS_CREATED samg2_get_levels_created
#define SAMG2_GET_LEVELS_USED samg2_get_levels_used
#define SAMG2_GET_LEV_SIZES samg2_get_lev_sizes
#define SAMG2_GET_MEM_ACTIVE samg2_get_mem_active
#define SAMG2_GET_TIME_AND_MEM samg2_get_time_and_mem
#define SAMG2_EXTRAPRINT samg2_extraprint
#define SAMG2_FLUSH samg2_flush
#define SAMG2_CVEC_ALLOC samg2_cvec_alloc
#define SAMG2_CVEC_DEALLOC samg2_cvec_dealloc
#define SAMG2_CVEC_SET samg2_cvec_set
#define SAMG2_CVEC_GET samg2_cvec_get
#define SAMG2_PROPOSE_NSYS_ISCALE_IU samg2_propose_nsys_iscale_iu
#define SAMG2_USED_OMP_THREADS samg2_used_omp_threads
#define SAMG2_GET_INNERMAX samg2_get_innermax
#define SAMG2_SET_INNERMAX samg2_set_innermax
#define SAMG2_DRV_SET_INNERMAX samg2_drv2_set_innermax
#define SAMG2_GET_NUM_SMOOTH_VECTORS samg2_get_num_smooth_vectors
#define SAMG2_SMOOTH_VECTOR_INIT samg2_smooth_vector_init
#define SAMG2_SMOOTH_VECTOR_SET samg2_smooth_vector_set
#define SAMG2_SMOOTH_VECTOR_GET samg2_smooth_vector_get
#define SAMG2_GET_NUM_DEFLATION_VECTORS samg2_get_num_deflation_vectors
#define SAMG2_DEFLATION_VECTOR_INIT samg2_deflation_vector_init
#define SAMG2_DEFLATION_VECTOR_SET samg2_deflation_vector_set
#define SAMG2_DEFLATION_VECTOR_GET samg2_deflation_vector_get
#define SAMG2_USER_CHECK samg2_user_check
#define SAMG2_USER_SOLVE samg2_user_solve
#define SAMG2_USER_CLEANUP samg2_user_cleanup
#define SAMG2_ARRAY_OFFSET samg2_array_offset
#define SAMG2_PERFINIT samg2_perfinit
#define SAMG2_PERFOUT samg2_perfout
#define SAMG2_PARALLEL_LIB samg2_parallel_lib
#define SAMG2_MEM_INFO samg2_mem_info
#define SAMG2_LRATIO samg2_lratio
#define SAMG2_ADDTIME samg2_addtime
#define SAMG2_COMPTIME samg2_comptime
#define SAMG2_COPY_GALERKIN samg2_copy_galerkin
#define SAMG2_OMEGA_JACOBI_ALLOC samg2_omega_jacobi_alloc
#define SAMG2_OMEGA_JACOBI_DEALLOC samg2_omega_jacobi_dealloc
#define SAMG2_OMEGA_JACOBI_SET samg2_omega_jacobi_set
#define SAMG2_CURRENT_RESIDUAL samg2_current_residual
#define SAMG2_OPEN_LOGFILE samg2_open_logfile
#define SAMG2_CLOSE_LOGFILE samg2_close_logfile
#define SAMG2_COO_VEC_SET samg2_coo_vec_set
#define SAMG2_COO_VEC_ALLOC samg2_coo_vec_alloc
#define SAMG2_COO_VEC_DEALLOC samg2_coo_vec_dealloc
#define SAMG2_IDEC samg2_idec
#define SAMG2_DC samg2_dc
#define XSAMG2 xsamg2
#define XSAMG2_DC xsamg2_dc
#define XSAMG2_START xsamg2_start
#define XSAMG2_START_LINUX xsamg2_start_linux
#define XSAMG2_USER_CTRL xsamg2_user_ctrl
#define XSAMG2_START_IUM xsamg2_start_ium
#define XSAMG2_START_SOLVER xsamg2_start_solver
#define XSAMG2_END_SOLVER xsamg2_end_solver
#define XSAMG2_FINALIZE xsamg2_finalize
#define XSAMG2_END xsamg2_end
#define XSAMG2_GET_LOGIO xsamg2_get_logio
#define XSAMG2_GET_SLAVE_RETURNCODE xsamg2_get_slave_returncode
#define XSAMG2_PROCESS_INFO xsamg2_process_info
#define XSAMG2_GET_INTERNAL_TIMER xsamg2_get_internal_timer
#define XSAMG2_MPI_INIT xsamg2_mpi_init
#define XSAMG2_MPI_FINALIZE xsamg2_mpi_finalize
#define XSAMG2_MPI_COMM_RANK xsamg2_mpi_comm_rank
#define XSAMG2_GET_MPI_COMM_WORLD xsamg2_get_mpi_comm_world
#define XSAMG2_GET_PARALLEL_RUN xsamg2_get_parallel_run
#define XSAMG2_IO_SETTINGS xsamg2_io_settings
#define XSAMG2_IO_SETTINGS2 xsamg2_io_settings2
#define XSAMG2_LAST_MSG xsamg2_last_msg
#define XSAMG2_READ_CONFIG xsamg2_read_config
#define XSAMG2_PRINT_INTERNAL_TIMER xsamg2_print_internal_timer
#define XSAMG2_ERROR_INFO xsamg2_error_info
#define XSAMG2_GET_IERR_ON_TAG_STOP xsamg2_get_ierr_on_tag_stop
#define XSAMG2_CONFIGFILE_MISSING xsamg2_configfile_missing
#define XSAMG2_LEAVE xsamg2_leave
#define XSAMG2_CLEANUP xsamg2_cleanup
#define SAMG2_DUMP_SEQUENCE_RESET samg2_dump_sequence_reset
#define SAMG2_GET_RESIDUAL_VECTOR_E samg2_get_residual_vector_e
#define SAMG2_GET_RESIDUAL_VECTOR_V samg2_get_residual_vector_v
#define SAMG2_RESIDUAL_VECTOR_LEAVE samg2_residual_vector_leave
#define SAMG2_SET_RESIDUAL_VECTOR_E samg2_set_residual_vector_e
#define SAMG2_SET_RESIDUAL_VECTOR_V samg2_set_residual_vector_v
#define SAMG2_SET_RESIDUAL_VECTOR_INIT samg2_set_residual_vector_init
#define XSAMG2_OIL xsamg2_oil
#define SAMG2_OIL samg2_oil
#define SAMG2_SET_RENUMBER_VEC samg2_set_renumber_vec
#define SAMG2_GET_RENUMBER_VEC samg2_get_renumber_vec
#define SAMG2_GETRE_NU samg2_getre_nu
#define SAMG2_GETDBLE_NU samg2_getdble_nu
#define SAMG2_GETINT_NU samg2_getint_nu
#define SAMG2_GETTE_NU samg2_gette_nu
#define SAMG2_GETLO_NU samg2_getlo_nu
#define SAMG2_GETSPEC_NU samg2_getspec_nu
#define SAMG2_SET_A_CMPLX_AGG_DEFAULT samg2_set_a_cmplx_agg_default
#define SAMG2_GET_A_CMPLX_AGG_DEFAULT samg2_get_a_cmplx_agg_default
#define SAMG2_SET_A_CMPLX_DEFAULT samg2_set_a_cmplx_default
#define SAMG2_GET_A_CMPLX_DEFAULT samg2_get_a_cmplx_default
#define SAMG2_SET_ALLOW_FILNAM_IN samg2_set_allow_filnam_in
#define SAMG2_GET_ALLOW_FILNAM_IN samg2_get_allow_filnam_in
#define SAMG2_SET_ALLOW_PRIVATE_IN samg2_set_allow_private_in
#define SAMG2_GET_ALLOW_PRIVATE_IN samg2_get_allow_private_in
#define SAMG2_SET_ALLOW_ELIM samg2_set_allow_elim
#define SAMG2_GET_ALLOW_ELIM samg2_get_allow_elim
#define SAMG2_SET_ALLUNS_AT_ALLPNTS samg2_set_alluns_at_allpnts
#define SAMG2_GET_ALLUNS_AT_ALLPNTS samg2_get_alluns_at_allpnts
#define SAMG2_SET_ART_TIME samg2_set_art_time
#define SAMG2_GET_ART_TIME samg2_get_art_time
#define SAMG2_SET_ART_TIME_CYC samg2_set_art_time_cyc
#define SAMG2_GET_ART_TIME_CYC samg2_get_art_time_cyc
#define SAMG2_SET_ART_TIME_CYC_2ND samg2_set_art_time_cyc_2nd
#define SAMG2_GET_ART_TIME_CYC_2ND samg2_get_art_time_cyc_2nd
#define SAMG2_SET_ART_TIME_SETUP samg2_set_art_time_setup
#define SAMG2_GET_ART_TIME_SETUP samg2_get_art_time_setup
#define SAMG2_SET_ART_TIME_SETUP_2ND samg2_set_art_time_setup_2nd
#define SAMG2_GET_ART_TIME_SETUP_2ND samg2_get_art_time_setup_2nd
#define SAMG2_SET_B_CMPLX samg2_set_b_cmplx
#define SAMG2_GET_B_CMPLX samg2_get_b_cmplx
#define SAMG2_SET_B_CMPLX_AGG_DEFAULT samg2_set_b_cmplx_agg_default
#define SAMG2_GET_B_CMPLX_AGG_DEFAULT samg2_get_b_cmplx_agg_default
#define SAMG2_SET_B_CMPLX_DEFAULT samg2_set_b_cmplx_default
#define SAMG2_GET_B_CMPLX_DEFAULT samg2_get_b_cmplx_default
#define SAMG2_SET_BACKUP samg2_set_backup
#define SAMG2_GET_BACKUP samg2_get_backup
#define SAMG2_SET_BLK_FILLEXP samg2_set_blk_fillexp
#define SAMG2_GET_BLK_FILLEXP samg2_get_blk_fillexp
#define SAMG2_SET_BLK_STAB samg2_set_blk_stab
#define SAMG2_GET_BLK_STAB samg2_get_blk_stab
#define SAMG2_SET_BLOCK_SCALE samg2_set_block_scale
#define SAMG2_GET_BLOCK_SCALE samg2_get_block_scale
#define SAMG2_SET_BLOCK_SCALE2 samg2_set_block_scale2
#define SAMG2_GET_BLOCK_SCALE2 samg2_get_block_scale2
#define SAMG2_SET_BLOCK_SCALE3 samg2_set_block_scale3
#define SAMG2_GET_BLOCK_SCALE3 samg2_get_block_scale3
#define SAMG2_SET_BS_AUTO_SIGN samg2_set_bs_auto_sign
#define SAMG2_GET_BS_AUTO_SIGN samg2_get_bs_auto_sign
#define SAMG2_SET_BS_MIN_BLOCK_SIZE samg2_set_bs_min_block_size
#define SAMG2_GET_BS_MIN_BLOCK_SIZE samg2_get_bs_min_block_size
#define SAMG2_SET_BS_OMP samg2_set_bs_omp
#define SAMG2_GET_BS_OMP samg2_get_bs_omp
#define SAMG2_ISET_BND_PARTITION_FILE samg2_iset_bnd_partition_file
#define SAMG2_IGET_BND_PARTITION_FILE samg2_iget_bnd_partition_file
#define SAMG2_SET_BND_PARTITION_FILE samg2_set_bnd_partition_file
#define SAMG2_GET_BND_PARTITION_FILE samg2_get_bnd_partition_file
#define SAMG2_SET_CHECK_ALLPNTS samg2_set_check_allpnts
#define SAMG2_GET_CHECK_ALLPNTS samg2_get_check_allpnts
#define SAMG2_SET_CHECK_ORDER samg2_set_check_order
#define SAMG2_GET_CHECK_ORDER samg2_get_check_order
#define SAMG2_SET_CHECK_BCSR_DUMP samg2_set_check_bcsr_dump
#define SAMG2_GET_CHECK_BCSR_DUMP samg2_get_check_bcsr_dump
#define SAMG2_SET_CL_CPL samg2_set_cl_cpl
#define SAMG2_GET_CL_CPL samg2_get_cl_cpl
#define SAMG2_SET_CL_ORDER samg2_set_cl_order
#define SAMG2_GET_CL_ORDER samg2_get_cl_order
#define SAMG2_SET_CL_OUTRES samg2_set_cl_outres
#define SAMG2_GET_CL_OUTRES samg2_get_cl_outres
#define SAMG2_SET_CL_LEVEL_DEP samg2_set_cl_level_dep
#define SAMG2_GET_CL_LEVEL_DEP samg2_get_cl_level_dep
#define SAMG2_SET_CL_AUTO_SIZE samg2_set_cl_auto_size
#define SAMG2_GET_CL_AUTO_SIZE samg2_get_cl_auto_size
#define SAMG2_SET_CL_PROC_BORDER samg2_set_cl_proc_border
#define SAMG2_GET_CL_PROC_BORDER samg2_get_cl_proc_border
#define SAMG2_SET_CL_QUALITY_MEASURE samg2_set_cl_quality_measure
#define SAMG2_GET_CL_QUALITY_MEASURE samg2_get_cl_quality_measure
#define SAMG2_SET_CL_GLOBAL_QUALITY samg2_set_cl_global_quality
#define SAMG2_GET_CL_GLOBAL_QUALITY samg2_get_cl_global_quality
#define SAMG2_SET_CL_OMP samg2_set_cl_omp
#define SAMG2_GET_CL_OMP samg2_get_cl_omp
#define SAMG2_SET_CL_CMK_REORDER samg2_set_cl_cmk_reorder
#define SAMG2_GET_CL_CMK_REORDER samg2_get_cl_cmk_reorder
#define SAMG2_SET_CLSOLVER_FINEST samg2_set_clsolver_finest
#define SAMG2_GET_CLSOLVER_FINEST samg2_get_clsolver_finest
#define SAMG2_SET_CLDENSE_CTRL samg2_set_cldense_ctrl
#define SAMG2_GET_CLDENSE_CTRL samg2_get_cldense_ctrl
#define SAMG2_SET_CONST_INT_GLK samg2_set_const_int_glk
#define SAMG2_GET_CONST_INT_GLK samg2_get_const_int_glk
#define SAMG2_SET_CONST_INT_SOL samg2_set_const_int_sol
#define SAMG2_GET_CONST_INT_SOL samg2_get_const_int_sol
#define SAMG2_SET_CNTRL_ENFORCE samg2_set_cntrl_enforce
#define SAMG2_GET_CNTRL_ENFORCE samg2_get_cntrl_enforce
#define SAMG2_SET_CNTRL_LOGFILE samg2_set_cntrl_logfile
#define SAMG2_GET_CNTRL_LOGFILE samg2_get_cntrl_logfile
#define SAMG2_SET_CNTRL_METHOD samg2_set_cntrl_method
#define SAMG2_GET_CNTRL_METHOD samg2_get_cntrl_method
#define SAMG2_SET_CNTRL_RELEASE samg2_set_cntrl_release
#define SAMG2_GET_CNTRL_RELEASE samg2_get_cntrl_release
#define SAMG2_SET_CNTRL_RES_DIFF samg2_set_cntrl_res_diff
#define SAMG2_GET_CNTRL_RES_DIFF samg2_get_cntrl_res_diff
#define SAMG2_SET_CNTRL_RETRY_ITER samg2_set_cntrl_retry_iter
#define SAMG2_GET_CNTRL_RETRY_ITER samg2_get_cntrl_retry_iter
#define SAMG2_SET_CNTRL_STEADY samg2_set_cntrl_steady
#define SAMG2_GET_CNTRL_STEADY samg2_get_cntrl_steady
#define SAMG2_SET_CONV_STOP samg2_set_conv_stop
#define SAMG2_GET_CONV_STOP samg2_get_conv_stop
#define SAMG2_SET_CORRECT_CLUSTER_INFO samg2_set_correct_cluster_info
#define SAMG2_GET_CORRECT_CLUSTER_INFO samg2_get_correct_cluster_info
#define SAMG2_SET_CSET_LASTPNT samg2_set_cset_lastpnt
#define SAMG2_GET_CSET_LASTPNT samg2_get_cset_lastpnt
#define SAMG2_SET_CSET_LESSVARS samg2_set_cset_lessvars
#define SAMG2_GET_CSET_LESSVARS samg2_get_cset_lessvars
#define SAMG2_SET_CSET_LONGROW samg2_set_cset_longrow
#define SAMG2_GET_CSET_LONGROW samg2_get_cset_longrow
#define SAMG2_ISET_CSET_READ samg2_iset_cset_read
#define SAMG2_IGET_CSET_READ samg2_iget_cset_read
#define SAMG2_SET_CSET_READ samg2_set_cset_read
#define SAMG2_GET_CSET_READ samg2_get_cset_read
#define SAMG2_SET_CSET_ZERODIAG samg2_set_cset_zerodiag
#define SAMG2_GET_CSET_ZERODIAG samg2_get_cset_zerodiag
#define SAMG2_SET_CSET_UNKNOWN samg2_set_cset_unknown
#define SAMG2_GET_CSET_UNKNOWN samg2_get_cset_unknown
#define SAMG2_SET_CSET_UNKNOWN1 samg2_set_cset_unknown1
#define SAMG2_GET_CSET_UNKNOWN1 samg2_get_cset_unknown1
#define SAMG2_SET_CSET_UNKNOWN2 samg2_set_cset_unknown2
#define SAMG2_GET_CSET_UNKNOWN2 samg2_get_cset_unknown2
#define SAMG2_SET_DELTA_MILU samg2_set_delta_milu
#define SAMG2_GET_DELTA_MILU samg2_get_delta_milu
#define SAMG2_SET_DENSX samg2_set_densx
#define SAMG2_GET_DENSX samg2_get_densx
#define SAMG2_SET_DIVERGENCE samg2_set_divergence
#define SAMG2_GET_DIVERGENCE samg2_get_divergence
#define SAMG2_SET_DIV_STOP_RULE samg2_set_div_stop_rule
#define SAMG2_GET_DIV_STOP_RULE samg2_get_div_stop_rule
#define SAMG2_SET_DIV_THRESHOLD samg2_set_div_threshold
#define SAMG2_GET_DIV_THRESHOLD samg2_get_div_threshold
#define SAMG2_SET_DROPTOL samg2_set_droptol
#define SAMG2_GET_DROPTOL samg2_get_droptol
#define SAMG2_SET_DROPTOL_CL samg2_set_droptol_cl
#define SAMG2_GET_DROPTOL_CL samg2_get_droptol_cl
#define SAMG2_SET_DROPTOL_2ND samg2_set_droptol_2nd
#define SAMG2_GET_DROPTOL_2ND samg2_get_droptol_2nd
#define SAMG2_SET_DROPTOL_SMO samg2_set_droptol_smo
#define SAMG2_GET_DROPTOL_SMO samg2_get_droptol_smo
#define SAMG2_SET_DUMP_APPROX_SOLUTION samg2_set_dump_approx_solution
#define SAMG2_GET_DUMP_APPROX_SOLUTION samg2_get_dump_approx_solution
#define SAMG2_SET_DUMP_CORRECTW samg2_set_dump_correctw
#define SAMG2_GET_DUMP_CORRECTW samg2_get_dump_correctw
#define SAMG2_SET_DUMP_GENERATED_SMOVEC samg2_set_dump_generated_smovec
#define SAMG2_GET_DUMP_GENERATED_SMOVEC samg2_get_dump_generated_smovec
#define SAMG2_SET_ECG samg2_set_ecg
#define SAMG2_GET_ECG samg2_get_ecg
#define SAMG2_SET_ECG_DEFAULT samg2_set_ecg_default
#define SAMG2_GET_ECG_DEFAULT samg2_get_ecg_default
#define SAMG2_SET_ICHOLESKY samg2_set_icholesky
#define SAMG2_GET_ICHOLESKY samg2_get_icholesky
#define SAMG2_SET_ENFORCE_FULLSMO samg2_set_enforce_fullsmo
#define SAMG2_GET_ENFORCE_FULLSMO samg2_get_enforce_fullsmo
#define SAMG2_SET_EPS_ABS samg2_set_eps_abs
#define SAMG2_GET_EPS_ABS samg2_get_eps_abs
#define SAMG2_SET_EPS_ACCEPT_JAC_UZAWA samg2_set_eps_accept_jac_uzawa
#define SAMG2_GET_EPS_ACCEPT_JAC_UZAWA samg2_get_eps_accept_jac_uzawa
#define SAMG2_SET_EPS_CONVERG_JAC_UZAWA samg2_set_eps_converg_jac_uzawa
#define SAMG2_GET_EPS_CONVERG_JAC_UZAWA samg2_get_eps_converg_jac_uzawa
#define SAMG2_SET_EPS_DD samg2_set_eps_dd
#define SAMG2_GET_EPS_DD samg2_get_eps_dd
#define SAMG2_SET_EPS_DIVERG_JAC_UZAWA samg2_set_eps_diverg_jac_uzawa
#define SAMG2_GET_EPS_DIVERG_JAC_UZAWA samg2_get_eps_diverg_jac_uzawa
#define SAMG2_SET_EPS_DIAG samg2_set_eps_diag
#define SAMG2_GET_EPS_DIAG samg2_get_eps_diag
#define SAMG2_SET_EPS_LSQ samg2_set_eps_lsq
#define SAMG2_GET_EPS_LSQ samg2_get_eps_lsq
#define SAMG2_SET_ETR samg2_set_etr
#define SAMG2_GET_ETR samg2_get_etr
#define SAMG2_SET_ETR_DEFAULT samg2_set_etr_default
#define SAMG2_GET_ETR_DEFAULT samg2_get_etr_default
#define SAMG2_SET_ETR2_SMO samg2_set_etr2_smo
#define SAMG2_GET_ETR2_SMO samg2_get_etr2_smo
#define SAMG2_SET_EWT samg2_set_ewt
#define SAMG2_GET_EWT samg2_get_ewt
#define SAMG2_SET_EWT_DEFAULT samg2_set_ewt_default
#define SAMG2_GET_EWT_DEFAULT samg2_get_ewt_default
#define SAMG2_SET_FACTOR_APP_VAR samg2_set_factor_app_var
#define SAMG2_GET_FACTOR_APP_VAR samg2_get_factor_app_var
#define SAMG2_SET_FACTOR_QUASI_RES samg2_set_factor_quasi_res
#define SAMG2_GET_FACTOR_QUASI_RES samg2_get_factor_quasi_res
#define SAMG2_SET_FACTOR_RES_VAR samg2_set_factor_res_var
#define SAMG2_GET_FACTOR_RES_VAR samg2_get_factor_res_var
#define SAMG2_SET_FACTOR_MATRIX_SCALE samg2_set_factor_matrix_scale
#define SAMG2_GET_FACTOR_MATRIX_SCALE samg2_get_factor_matrix_scale
#define SAMG2_SET_FACTOR_SOL_JAC_UZAWA samg2_set_factor_sol_jac_uzawa
#define SAMG2_GET_FACTOR_SOL_JAC_UZAWA samg2_get_factor_sol_jac_uzawa
#define SAMG2_ISET_FILNAM samg2_iset_filnam
#define SAMG2_IGET_FILNAM samg2_iget_filnam
#define SAMG2_SET_FILNAM samg2_set_filnam
#define SAMG2_GET_FILNAM samg2_get_filnam
#define SAMG2_ISET_FILNAM_DUMPSOL samg2_iset_filnam_dumpsol
#define SAMG2_IGET_FILNAM_DUMPSOL samg2_iget_filnam_dumpsol
#define SAMG2_SET_FILNAM_DUMPSOL samg2_set_filnam_dumpsol
#define SAMG2_GET_FILNAM_DUMPSOL samg2_get_filnam_dumpsol
#define SAMG2_ISET_FILNAM_DUMP samg2_iset_filnam_dump
#define SAMG2_IGET_FILNAM_DUMP samg2_iget_filnam_dump
#define SAMG2_SET_FILNAM_DUMP samg2_set_filnam_dump
#define SAMG2_GET_FILNAM_DUMP samg2_get_filnam_dump
#define SAMG2_ISET_FILNAM_UZAWA samg2_iset_filnam_uzawa
#define SAMG2_IGET_FILNAM_UZAWA samg2_iget_filnam_uzawa
#define SAMG2_SET_FILNAM_UZAWA samg2_set_filnam_uzawa
#define SAMG2_GET_FILNAM_UZAWA samg2_get_filnam_uzawa
#define SAMG2_SET_FLEX_PCG_LITE samg2_set_flex_pcg_lite
#define SAMG2_GET_FLEX_PCG_LITE samg2_get_flex_pcg_lite
#define SAMG2_SET_FORCE_ACCEL samg2_set_force_accel
#define SAMG2_GET_FORCE_ACCEL samg2_get_force_accel
#define SAMG2_SET_FORCE_ACCEL_2ND samg2_set_force_accel_2nd
#define SAMG2_GET_FORCE_ACCEL_2ND samg2_get_force_accel_2nd
#define SAMG2_SET_FULL_PIVOTING samg2_set_full_pivoting
#define SAMG2_GET_FULL_PIVOTING samg2_get_full_pivoting
#define SAMG2_SET_FULL_SETUP samg2_set_full_setup
#define SAMG2_GET_FULL_SETUP samg2_get_full_setup
#define SAMG2_SET_G_CMPLX_AGG_DEFAULT samg2_set_g_cmplx_agg_default
#define SAMG2_GET_G_CMPLX_AGG_DEFAULT samg2_get_g_cmplx_agg_default
#define SAMG2_SET_G_CMPLX_DEFAULT samg2_set_g_cmplx_default
#define SAMG2_GET_G_CMPLX_DEFAULT samg2_get_g_cmplx_default
#define SAMG2_SET_GALERKIN_TIMER samg2_set_galerkin_timer
#define SAMG2_GET_GALERKIN_TIMER samg2_get_galerkin_timer
#define SAMG2_SET_GLK_MULT_ZEROS samg2_set_glk_mult_zeros
#define SAMG2_GET_GLK_MULT_ZEROS samg2_get_glk_mult_zeros
#define SAMG2_SET_GMAX_MULTIPASS samg2_set_gmax_multipass
#define SAMG2_GET_GMAX_MULTIPASS samg2_get_gmax_multipass
#define SAMG2_SET_IAGGREGATION_PROFILE samg2_set_iaggregation_profile
#define SAMG2_GET_IAGGREGATION_PROFILE samg2_get_iaggregation_profile
#define SAMG2_SET_IAGGREGATION samg2_set_iaggregation
#define SAMG2_GET_IAGGREGATION samg2_get_iaggregation
#define SAMG2_SET_IALL_SMO samg2_set_iall_smo
#define SAMG2_GET_IALL_SMO samg2_get_iall_smo
#define SAMG2_SET_IAUTO_OMEGA_JACOBI samg2_set_iauto_omega_jacobi
#define SAMG2_GET_IAUTO_OMEGA_JACOBI samg2_get_iauto_omega_jacobi
#define SAMG2_SET_IAUTO_OMEGA_SMOAGG samg2_set_iauto_omega_smoagg
#define SAMG2_GET_IAUTO_OMEGA_SMOAGG samg2_get_iauto_omega_smoagg
#define SAMG2_SET_IAUTO_STOP samg2_set_iauto_stop
#define SAMG2_GET_IAUTO_STOP samg2_get_iauto_stop
#define SAMG2_SET_IDUMP_SEQUENCE_START samg2_set_idump_sequence_start
#define SAMG2_GET_IDUMP_SEQUENCE_START samg2_get_idump_sequence_start
#define SAMG2_SET_IDUMP_SEQUENCE_END samg2_set_idump_sequence_end
#define SAMG2_GET_IDUMP_SEQUENCE_END samg2_get_idump_sequence_end
#define SAMG2_SET_ISTAB_CG samg2_set_istab_cg
#define SAMG2_GET_ISTAB_CG samg2_get_istab_cg
#define SAMG2_SET_IELASTICITY_PROFILE samg2_set_ielasticity_profile
#define SAMG2_GET_IELASTICITY_PROFILE samg2_get_ielasticity_profile
#define SAMG2_SET_IELASTICITY samg2_set_ielasticity
#define SAMG2_GET_IELASTICITY samg2_get_ielasticity
#define SAMG2_SET_IESTIM_SPECT_RADIUS samg2_set_iestim_spect_radius
#define SAMG2_GET_IESTIM_SPECT_RADIUS samg2_get_iestim_spect_radius
#define SAMG2_SET_IESTIM_SMOOTH_NIT samg2_set_iestim_smooth_nit
#define SAMG2_GET_IESTIM_SMOOTH_NIT samg2_get_iestim_smooth_nit
#define SAMG2_SET_INIT_RES_TREATMENT samg2_set_init_res_treatment
#define SAMG2_GET_INIT_RES_TREATMENT samg2_get_init_res_treatment
#define SAMG2_SET_IPRNT_RES_ACCURACY samg2_set_iprnt_res_accuracy
#define SAMG2_GET_IPRNT_RES_ACCURACY samg2_get_iprnt_res_accuracy
#define SAMG2_SET_ISMO2DFL samg2_set_ismo2dfl
#define SAMG2_GET_ISMO2DFL samg2_get_ismo2dfl
#define SAMG2_SET_ISMOAGG_AGGRESSIVE samg2_set_ismoagg_aggressive
#define SAMG2_GET_ISMOAGG_AGGRESSIVE samg2_get_ismoagg_aggressive
#define SAMG2_SET_ISMOAGG_OVERCORRECTION samg2_set_ismoagg_overcorrection
#define SAMG2_GET_ISMOAGG_OVERCORRECTION samg2_get_ismoagg_overcorrection
#define SAMG2_SET_ISMOAGG_OPTIM samg2_set_ismoagg_optim
#define SAMG2_GET_ISMOAGG_OPTIM samg2_get_ismoagg_optim
#define SAMG2_SET_ISMOAGG_BLOCK_TYP samg2_set_ismoagg_block_typ
#define SAMG2_GET_ISMOAGG_BLOCK_TYP samg2_get_ismoagg_block_typ
#define SAMG2_SET_ISMOAGG_COMPRESSION samg2_set_ismoagg_compression
#define SAMG2_GET_ISMOAGG_COMPRESSION samg2_get_ismoagg_compression
#define SAMG2_SET_ISMOAGG_FILTER_TYP samg2_set_ismoagg_filter_typ
#define SAMG2_GET_ISMOAGG_FILTER_TYP samg2_get_ismoagg_filter_typ
#define SAMG2_SET_ISMOAGG_SMOOTH_TYP samg2_set_ismoagg_smooth_typ
#define SAMG2_GET_ISMOAGG_SMOOTH_TYP samg2_get_ismoagg_smooth_typ
#define SAMG2_SET_ISMOAGG_SMOOTH_NIT samg2_set_ismoagg_smooth_nit
#define SAMG2_GET_ISMOAGG_SMOOTH_NIT samg2_get_ismoagg_smooth_nit
#define SAMG2_SET_ISMOAGG_SMOOTH_1LEV samg2_set_ismoagg_smooth_1lev
#define SAMG2_GET_ISMOAGG_SMOOTH_1LEV samg2_get_ismoagg_smooth_1lev
#define SAMG2_SET_ISMOAGG_SMOOTH_NLEV samg2_set_ismoagg_smooth_nlev
#define SAMG2_GET_ISMOAGG_SMOOTH_NLEV samg2_get_ismoagg_smooth_nlev
#define SAMG2_SET_IB_CMPLX samg2_set_ib_cmplx
#define SAMG2_GET_IB_CMPLX samg2_get_ib_cmplx
#define SAMG2_SET_IB_CMPLX_AGG_DEFAULT samg2_set_ib_cmplx_agg_default
#define SAMG2_GET_IB_CMPLX_AGG_DEFAULT samg2_get_ib_cmplx_agg_default
#define SAMG2_SET_IB_CMPLX_DEFAULT samg2_set_ib_cmplx_default
#define SAMG2_GET_IB_CMPLX_DEFAULT samg2_get_ib_cmplx_default
#define SAMG2_SET_IBGS_PIVOT samg2_set_ibgs_pivot
#define SAMG2_GET_IBGS_PIVOT samg2_get_ibgs_pivot
#define SAMG2_SET_ICASE_JAC_UZAWA samg2_set_icase_jac_uzawa
#define SAMG2_GET_ICASE_JAC_UZAWA samg2_get_icase_jac_uzawa
#define SAMG2_SET_ISTATISTICS_SMOVEC samg2_set_istatistics_smovec
#define SAMG2_GET_ISTATISTICS_SMOVEC samg2_get_istatistics_smovec
#define SAMG2_SET_ICHECK_SMOINT samg2_set_icheck_smoint
#define SAMG2_GET_ICHECK_SMOINT samg2_get_icheck_smoint
#define SAMG2_SET_ICOLOR_OMP samg2_set_icolor_omp
#define SAMG2_GET_ICOLOR_OMP samg2_get_icolor_omp
#define SAMG2_SET_IORDERED_OMP samg2_set_iordered_omp
#define SAMG2_GET_IORDERED_OMP samg2_get_iordered_omp
#define SAMG2_SET_ICRITS samg2_set_icrits
#define SAMG2_GET_ICRITS samg2_get_icrits
#define SAMG2_SET_IDTEST_UZAWA samg2_set_idtest_uzawa
#define SAMG2_GET_IDTEST_UZAWA samg2_get_idtest_uzawa
#define SAMG2_SET_IHUGE samg2_set_ihuge
#define SAMG2_GET_IHUGE samg2_get_ihuge
#define SAMG2_SET_IJAC_UZAWA samg2_set_ijac_uzawa
#define SAMG2_GET_IJAC_UZAWA samg2_get_ijac_uzawa
#define SAMG2_SET_ILU4ALLSCHWARZ samg2_set_ilu4allschwarz
