openCSMP/openCSMP/lib/samg/samg2.h
#ifdef SAMG_LCASE_USCORE
#define SAMG2 samg2_
#define SAMG2_CTIME samg2_ctime_
#define SAMG2_CPUTIME samg2_cputime_
#define SAMG2_ELAPSED_TIME samg2_elapsed_time_
#define SAMG2_ALL_ERRORINFO samg2_all_errorinfo_
#define SAMG2_SIMPLE samg2_simple_
#define SAMG2_MAIN samg2_main_
#define SAMG2_LEAVE samg2_leave_
#define SAMG2_REFRESH samg2_refresh_
#define SAMG2_CLEANUP samg2_cleanup_
#define SAMG2_RESET_HIDDEN samg2_reset_hidden_
#define SAMG2_GET_COMPLEXITIES samg2_get_complexities_
#define SAMG2_GET_NFLAG samg2_get_nflag_
#define SAMG2_SET_NFLAG samg2_set_nflag_
#define SAMG2_GET_NFLAGO samg2_get_nflago_
#define SAMG2_SET_NFLAGO samg2_set_nflago_
#define SAMG2_GET_NFLAGP samg2_get_nflagp_
#define SAMG2_SET_NFLAGP samg2_set_nflagp_
#define SAMG2_GET_NFLAGS samg2_get_nflags_
#define SAMG2_SET_NFLAGS samg2_set_nflags_
#define SAMG2_GET_LEVELS_CREATED samg2_get_levels_created_
#define SAMG2_GET_LEVELS_USED samg2_get_levels_used_
#define SAMG2_GET_LEV_SIZES samg2_get_lev_sizes_
#define SAMG2_GET_MEM_ACTIVE samg2_get_mem_active_
#define SAMG2_GET_TIME_AND_MEM samg2_get_time_and_mem_
#define SAMG2_EXTRAPRINT samg2_extraprint_
#define SAMG2_FLUSH samg2_flush_
#define SAMG2_CVEC_ALLOC samg2_cvec_alloc_
#define SAMG2_CVEC_DEALLOC samg2_cvec_dealloc_
#define SAMG2_CVEC_SET samg2_cvec_set_
#define SAMG2_CVEC_GET samg2_cvec_get_
#define SAMG2_PROPOSE_NSYS_ISCALE_IU samg2_propose_nsys_iscale_iu_
#define SAMG2_USED_OMP_THREADS samg2_used_omp_threads_
#define SAMG2_GET_INNERMAX samg2_get_innermax_
#define SAMG2_SET_INNERMAX samg2_set_innermax_
#define SAMG2_DRV_SET_INNERMAX samg2_drv2_set_innermax_
#define SAMG2_GET_NUM_SMOOTH_VECTORS samg2_get_num_smooth_vectors_
#define SAMG2_SMOOTH_VECTOR_INIT samg2_smooth_vector_init_
#define SAMG2_SMOOTH_VECTOR_SET samg2_smooth_vector_set_
#define SAMG2_SMOOTH_VECTOR_GET samg2_smooth_vector_get_
#define SAMG2_GET_NUM_DEFLATION_VECTORS samg2_get_num_deflation_vectors_
#define SAMG2_DEFLATION_VECTOR_INIT samg2_deflation_vector_init_
#define SAMG2_DEFLATION_VECTOR_SET samg2_deflation_vector_set_
#define SAMG2_DEFLATION_VECTOR_GET samg2_deflation_vector_get_
#define SAMG2_USER_CHECK samg2_user_check_
#define SAMG2_USER_SOLVE samg2_user_solve_
#define SAMG2_USER_CLEANUP samg2_user_cleanup_
#define SAMG2_ARRAY_OFFSET samg2_array_offset_
#define SAMG2_PERFINIT samg2_perfinit_
#define SAMG2_PERFOUT samg2_perfout_
#define SAMG2_PARALLEL_LIB samg2_parallel_lib_
#define SAMG2_MEM_INFO samg2_mem_info_
#define SAMG2_LRATIO samg2_lratio_
#define SAMG2_ADDTIME samg2_addtime_
#define SAMG2_COMPTIME samg2_comptime_
#define SAMG2_COPY_GALERKIN samg2_copy_galerkin_
#define SAMG2_OMEGA_JACOBI_ALLOC samg2_omega_jacobi_alloc_
#define SAMG2_OMEGA_JACOBI_DEALLOC samg2_omega_jacobi_dealloc_
#define SAMG2_OMEGA_JACOBI_SET samg2_omega_jacobi_set_
#define SAMG2_CURRENT_RESIDUAL samg2_current_residual_
#define SAMG2_OPEN_LOGFILE samg2_open_logfile_
#define SAMG2_CLOSE_LOGFILE samg2_close_logfile_
#define SAMG2_COO_VEC_SET samg2_coo_vec_set_
#define SAMG2_COO_VEC_ALLOC samg2_coo_vec_alloc_
#define SAMG2_COO_VEC_DEALLOC samg2_coo_vec_dealloc_
#define SAMG2_IDEC samg2_idec_
#define SAMG2_DC samg2_dc_
#define XSAMG2 xsamg2_
#define XSAMG2_DC xsamg2_dc_
#define XSAMG2_START xsamg2_start_
#define XSAMG2_START_LINUX xsamg2_start_linux_
#define XSAMG2_USER_CTRL xsamg2_user_ctrl_
#define XSAMG2_START_IUM xsamg2_start_ium_
#define XSAMG2_START_SOLVER xsamg2_start_solver_
#define XSAMG2_END_SOLVER xsamg2_end_solver_
#define XSAMG2_FINALIZE xsamg2_finalize_
#define XSAMG2_END xsamg2_end_
#define XSAMG2_GET_LOGIO xsamg2_get_logio_
#define XSAMG2_GET_SLAVE_RETURNCODE xsamg2_get_slave_returncode_
#define XSAMG2_PROCESS_INFO xsamg2_process_info_
#define XSAMG2_GET_INTERNAL_TIMER xsamg2_get_internal_timer_
#define XSAMG2_MPI_INIT xsamg2_mpi_init_
#define XSAMG2_MPI_FINALIZE xsamg2_mpi_finalize_
#define XSAMG2_MPI_COMM_RANK xsamg2_mpi_comm_rank_
#define XSAMG2_GET_MPI_COMM_WORLD xsamg2_get_mpi_comm_world_
#define XSAMG2_GET_PARALLEL_RUN xsamg2_get_parallel_run_
#define XSAMG2_IO_SETTINGS xsamg2_io_settings_
#define XSAMG2_IO_SETTINGS2 xsamg2_io_settings2_
#define XSAMG2_LAST_MSG xsamg2_last_msg_
#define XSAMG2_READ_CONFIG xsamg2_read_config_
#define XSAMG2_PRINT_INTERNAL_TIMER xsamg2_print_internal_timer_
#define XSAMG2_ERROR_INFO xsamg2_error_info_
#define XSAMG2_GET_IERR_ON_TAG_STOP xsamg2_get_ierr_on_tag_stop_
#define XSAMG2_CONFIGFILE_MISSING xsamg2_configfile_missing_
#define XSAMG2_LEAVE xsamg2_leave_
#define XSAMG2_CLEANUP xsamg2_cleanup_
#define SAMG2_DUMP_SEQUENCE_RESET samg2_dump_sequence_reset_
#define SAMG2_GET_RESIDUAL_VECTOR_E samg2_get_residual_vector_e_
#define SAMG2_GET_RESIDUAL_VECTOR_V samg2_get_residual_vector_v_
#define SAMG2_RESIDUAL_VECTOR_LEAVE samg2_residual_vector_leave_
#define SAMG2_SET_RESIDUAL_VECTOR_E samg2_set_residual_vector_e_
#define SAMG2_SET_RESIDUAL_VECTOR_V samg2_set_residual_vector_v_
#define SAMG2_SET_RESIDUAL_VECTOR_INIT samg2_set_residual_vector_init_
#define XSAMG2_OIL xsamg2_oil_
#define SAMG2_OIL samg2_oil_
#define SAMG2_SET_RENUMBER_VEC samg2_set_renumber_vec_
#define SAMG2_GET_RENUMBER_VEC samg2_get_renumber_vec_
#define SAMG2_GETRE_NU samg2_getre_nu_
#define SAMG2_GETDBLE_NU samg2_getdble_nu_
#define SAMG2_GETINT_NU samg2_getint_nu_
#define SAMG2_GETTE_NU samg2_gette_nu_
#define SAMG2_GETLO_NU samg2_getlo_nu_
#define SAMG2_GETSPEC_NU samg2_getspec_nu_
#define SAMG2_SET_A_CMPLX_AGG_DEFAULT samg2_set_a_cmplx_agg_default_
#define SAMG2_GET_A_CMPLX_AGG_DEFAULT samg2_get_a_cmplx_agg_default_
#define SAMG2_SET_A_CMPLX_DEFAULT samg2_set_a_cmplx_default_
#define SAMG2_GET_A_CMPLX_DEFAULT samg2_get_a_cmplx_default_
#define SAMG2_SET_ALLOW_FILNAM_IN samg2_set_allow_filnam_in_
#define SAMG2_GET_ALLOW_FILNAM_IN samg2_get_allow_filnam_in_
#define SAMG2_SET_ALLOW_PRIVATE_IN samg2_set_allow_private_in_
#define SAMG2_GET_ALLOW_PRIVATE_IN samg2_get_allow_private_in_
#define SAMG2_SET_ALLOW_ELIM samg2_set_allow_elim_
#define SAMG2_GET_ALLOW_ELIM samg2_get_allow_elim_
#define SAMG2_SET_ALLUNS_AT_ALLPNTS samg2_set_alluns_at_allpnts_
#define SAMG2_GET_ALLUNS_AT_ALLPNTS samg2_get_alluns_at_allpnts_
#define SAMG2_SET_ART_TIME samg2_set_art_time_
#define SAMG2_GET_ART_TIME samg2_get_art_time_
#define SAMG2_SET_ART_TIME_CYC samg2_set_art_time_cyc_
#define SAMG2_GET_ART_TIME_CYC samg2_get_art_time_cyc_
#define SAMG2_SET_ART_TIME_CYC_2ND samg2_set_art_time_cyc_2nd_
#define SAMG2_GET_ART_TIME_CYC_2ND samg2_get_art_time_cyc_2nd_
#define SAMG2_SET_ART_TIME_SETUP samg2_set_art_time_setup_
#define SAMG2_GET_ART_TIME_SETUP samg2_get_art_time_setup_
#define SAMG2_SET_ART_TIME_SETUP_2ND samg2_set_art_time_setup_2nd_
#define SAMG2_GET_ART_TIME_SETUP_2ND samg2_get_art_time_setup_2nd_
#define SAMG2_SET_B_CMPLX samg2_set_b_cmplx_
#define SAMG2_GET_B_CMPLX samg2_get_b_cmplx_
#define SAMG2_SET_B_CMPLX_AGG_DEFAULT samg2_set_b_cmplx_agg_default_
#define SAMG2_GET_B_CMPLX_AGG_DEFAULT samg2_get_b_cmplx_agg_default_
#define SAMG2_SET_B_CMPLX_DEFAULT samg2_set_b_cmplx_default_
#define SAMG2_GET_B_CMPLX_DEFAULT samg2_get_b_cmplx_default_
#define SAMG2_SET_BACKUP samg2_set_backup_
#define SAMG2_GET_BACKUP samg2_get_backup_
#define SAMG2_SET_BLK_FILLEXP samg2_set_blk_fillexp_
#define SAMG2_GET_BLK_FILLEXP samg2_get_blk_fillexp_
#define SAMG2_SET_BLK_STAB samg2_set_blk_stab_
#define SAMG2_GET_BLK_STAB samg2_get_blk_stab_
#define SAMG2_SET_BLOCK_SCALE samg2_set_block_scale_
#define SAMG2_GET_BLOCK_SCALE samg2_get_block_scale_
#define SAMG2_SET_BLOCK_SCALE2 samg2_set_block_scale2_
#define SAMG2_GET_BLOCK_SCALE2 samg2_get_block_scale2_
#define SAMG2_SET_BLOCK_SCALE3 samg2_set_block_scale3_
#define SAMG2_GET_BLOCK_SCALE3 samg2_get_block_scale3_
#define SAMG2_SET_BS_AUTO_SIGN samg2_set_bs_auto_sign_
#define SAMG2_GET_BS_AUTO_SIGN samg2_get_bs_auto_sign_
#define SAMG2_SET_BS_MIN_BLOCK_SIZE samg2_set_bs_min_block_size_
#define SAMG2_GET_BS_MIN_BLOCK_SIZE samg2_get_bs_min_block_size_
#define SAMG2_SET_BS_OMP samg2_set_bs_omp_
#define SAMG2_GET_BS_OMP samg2_get_bs_omp_
#define SAMG2_ISET_BND_PARTITION_FILE samg2_iset_bnd_partition_file_
#define SAMG2_IGET_BND_PARTITION_FILE samg2_iget_bnd_partition_file_
#define SAMG2_SET_BND_PARTITION_FILE samg2_set_bnd_partition_file_
#define SAMG2_GET_BND_PARTITION_FILE samg2_get_bnd_partition_file_
#define SAMG2_SET_CHECK_ALLPNTS samg2_set_check_allpnts_
#define SAMG2_GET_CHECK_ALLPNTS samg2_get_check_allpnts_
#define SAMG2_SET_CHECK_ORDER samg2_set_check_order_
#define SAMG2_GET_CHECK_ORDER samg2_get_check_order_
#define SAMG2_SET_CHECK_BCSR_DUMP samg2_set_check_bcsr_dump_
#define SAMG2_GET_CHECK_BCSR_DUMP samg2_get_check_bcsr_dump_
#define SAMG2_SET_CL_CPL samg2_set_cl_cpl_
#define SAMG2_GET_CL_CPL samg2_get_cl_cpl_
#define SAMG2_SET_CL_ORDER samg2_set_cl_order_
#define SAMG2_GET_CL_ORDER samg2_get_cl_order_
#define SAMG2_SET_CL_OUTRES samg2_set_cl_outres_
#define SAMG2_GET_CL_OUTRES samg2_get_cl_outres_
#define SAMG2_SET_CL_LEVEL_DEP samg2_set_cl_level_dep_
#define SAMG2_GET_CL_LEVEL_DEP samg2_get_cl_level_dep_
#define SAMG2_SET_CL_AUTO_SIZE samg2_set_cl_auto_size_
#define SAMG2_GET_CL_AUTO_SIZE samg2_get_cl_auto_size_
#define SAMG2_SET_CL_PROC_BORDER samg2_set_cl_proc_border_
#define SAMG2_GET_CL_PROC_BORDER samg2_get_cl_proc_border_
#define SAMG2_SET_CL_QUALITY_MEASURE samg2_set_cl_quality_measure_
#define SAMG2_GET_CL_QUALITY_MEASURE samg2_get_cl_quality_measure_
#define SAMG2_SET_CL_GLOBAL_QUALITY samg2_set_cl_global_quality_
#define SAMG2_GET_CL_GLOBAL_QUALITY samg2_get_cl_global_quality_
#define SAMG2_SET_CL_OMP samg2_set_cl_omp_
#define SAMG2_GET_CL_OMP samg2_get_cl_omp_
#define SAMG2_SET_CL_CMK_REORDER samg2_set_cl_cmk_reorder_
#define SAMG2_GET_CL_CMK_REORDER samg2_get_cl_cmk_reorder_
#define SAMG2_SET_CLSOLVER_FINEST samg2_set_clsolver_finest_
#define SAMG2_GET_CLSOLVER_FINEST samg2_get_clsolver_finest_
#define SAMG2_SET_CLDENSE_CTRL samg2_set_cldense_ctrl_
#define SAMG2_GET_CLDENSE_CTRL samg2_get_cldense_ctrl_
#define SAMG2_SET_CONST_INT_GLK samg2_set_const_int_glk_
#define SAMG2_GET_CONST_INT_GLK samg2_get_const_int_glk_
#define SAMG2_SET_CONST_INT_SOL samg2_set_const_int_sol_
#define SAMG2_GET_CONST_INT_SOL samg2_get_const_int_sol_
#define SAMG2_SET_CNTRL_ENFORCE samg2_set_cntrl_enforce_
#define SAMG2_GET_CNTRL_ENFORCE samg2_get_cntrl_enforce_
#define SAMG2_SET_CNTRL_LOGFILE samg2_set_cntrl_logfile_
#define SAMG2_GET_CNTRL_LOGFILE samg2_get_cntrl_logfile_
#define SAMG2_SET_CNTRL_METHOD samg2_set_cntrl_method_
#define SAMG2_GET_CNTRL_METHOD samg2_get_cntrl_method_
#define SAMG2_SET_CNTRL_RELEASE samg2_set_cntrl_release_
#define SAMG2_GET_CNTRL_RELEASE samg2_get_cntrl_release_
#define SAMG2_SET_CNTRL_RES_DIFF samg2_set_cntrl_res_diff_
#define SAMG2_GET_CNTRL_RES_DIFF samg2_get_cntrl_res_diff_
#define SAMG2_SET_CNTRL_RETRY_ITER samg2_set_cntrl_retry_iter_
#define SAMG2_GET_CNTRL_RETRY_ITER samg2_get_cntrl_retry_iter_
#define SAMG2_SET_CNTRL_STEADY samg2_set_cntrl_steady_
#define SAMG2_GET_CNTRL_STEADY samg2_get_cntrl_steady_
#define SAMG2_SET_CONV_STOP samg2_set_conv_stop_
#define SAMG2_GET_CONV_STOP samg2_get_conv_stop_
#define SAMG2_SET_CORRECT_CLUSTER_INFO samg2_set_correct_cluster_info_
#define SAMG2_GET_CORRECT_CLUSTER_INFO samg2_get_correct_cluster_info_
#define SAMG2_SET_CSET_LASTPNT samg2_set_cset_lastpnt_
#define SAMG2_GET_CSET_LASTPNT samg2_get_cset_lastpnt_
#define SAMG2_SET_CSET_LESSVARS samg2_set_cset_lessvars_
#define SAMG2_GET_CSET_LESSVARS samg2_get_cset_lessvars_
#define SAMG2_SET_CSET_LONGROW samg2_set_cset_longrow_
#define SAMG2_GET_CSET_LONGROW samg2_get_cset_longrow_
#define SAMG2_ISET_CSET_READ samg2_iset_cset_read_
#define SAMG2_IGET_CSET_READ samg2_iget_cset_read_
#define SAMG2_SET_CSET_READ samg2_set_cset_read_
#define SAMG2_GET_CSET_READ samg2_get_cset_read_
#define SAMG2_SET_CSET_ZERODIAG samg2_set_cset_zerodiag_
#define SAMG2_GET_CSET_ZERODIAG samg2_get_cset_zerodiag_
#define SAMG2_SET_CSET_UNKNOWN samg2_set_cset_unknown_
#define SAMG2_GET_CSET_UNKNOWN samg2_get_cset_unknown_
#define SAMG2_SET_CSET_UNKNOWN1 samg2_set_cset_unknown1_
#define SAMG2_GET_CSET_UNKNOWN1 samg2_get_cset_unknown1_
#define SAMG2_SET_CSET_UNKNOWN2 samg2_set_cset_unknown2_
#define SAMG2_GET_CSET_UNKNOWN2 samg2_get_cset_unknown2_
#define SAMG2_SET_DELTA_MILU samg2_set_delta_milu_
#define SAMG2_GET_DELTA_MILU samg2_get_delta_milu_
#define SAMG2_SET_DENSX samg2_set_densx_
#define SAMG2_GET_DENSX samg2_get_densx_
#define SAMG2_SET_DIVERGENCE samg2_set_divergence_
#define SAMG2_GET_DIVERGENCE samg2_get_divergence_
#define SAMG2_SET_DIV_STOP_RULE samg2_set_div_stop_rule_
#define SAMG2_GET_DIV_STOP_RULE samg2_get_div_stop_rule_
#define SAMG2_SET_DIV_THRESHOLD samg2_set_div_threshold_
#define SAMG2_GET_DIV_THRESHOLD samg2_get_div_threshold_
#define SAMG2_SET_DROPTOL samg2_set_droptol_
#define SAMG2_GET_DROPTOL samg2_get_droptol_
#define SAMG2_SET_DROPTOL_CL samg2_set_droptol_cl_
#define SAMG2_GET_DROPTOL_CL samg2_get_droptol_cl_
#define SAMG2_SET_DROPTOL_2ND samg2_set_droptol_2nd_
#define SAMG2_GET_DROPTOL_2ND samg2_get_droptol_2nd_
#define SAMG2_SET_DROPTOL_SMO samg2_set_droptol_smo_
#define SAMG2_GET_DROPTOL_SMO samg2_get_droptol_smo_
#define SAMG2_SET_DUMP_APPROX_SOLUTION samg2_set_dump_approx_solution_
#define SAMG2_GET_DUMP_APPROX_SOLUTION samg2_get_dump_approx_solution_
#define SAMG2_SET_DUMP_CORRECTW samg2_set_dump_correctw_
#define SAMG2_GET_DUMP_CORRECTW samg2_get_dump_correctw_
#define SAMG2_SET_DUMP_GENERATED_SMOVEC samg2_set_dump_generated_smovec_
#define SAMG2_GET_DUMP_GENERATED_SMOVEC samg2_get_dump_generated_smovec_
#define SAMG2_SET_ECG samg2_set_ecg_
#define SAMG2_GET_ECG samg2_get_ecg_
#define SAMG2_SET_ECG_DEFAULT samg2_set_ecg_default_
#define SAMG2_GET_ECG_DEFAULT samg2_get_ecg_default_
#define SAMG2_SET_ICHOLESKY samg2_set_icholesky_
#define SAMG2_GET_ICHOLESKY samg2_get_icholesky_
#define SAMG2_SET_ENFORCE_FULLSMO samg2_set_enforce_fullsmo_
#define SAMG2_GET_ENFORCE_FULLSMO samg2_get_enforce_fullsmo_
#define SAMG2_SET_EPS_ABS samg2_set_eps_abs_
#define SAMG2_GET_EPS_ABS samg2_get_eps_abs_
#define SAMG2_SET_EPS_ACCEPT_JAC_UZAWA samg2_set_eps_accept_jac_uzawa_
#define SAMG2_GET_EPS_ACCEPT_JAC_UZAWA samg2_get_eps_accept_jac_uzawa_
#define SAMG2_SET_EPS_CONVERG_JAC_UZAWA samg2_set_eps_converg_jac_uzawa_
#define SAMG2_GET_EPS_CONVERG_JAC_UZAWA samg2_get_eps_converg_jac_uzawa_
#define SAMG2_SET_EPS_DD samg2_set_eps_dd_
#define SAMG2_GET_EPS_DD samg2_get_eps_dd_
#define SAMG2_SET_EPS_DIVERG_JAC_UZAWA samg2_set_eps_diverg_jac_uzawa_
#define SAMG2_GET_EPS_DIVERG_JAC_UZAWA samg2_get_eps_diverg_jac_uzawa_
#define SAMG2_SET_EPS_DIAG samg2_set_eps_diag_
#define SAMG2_GET_EPS_DIAG samg2_get_eps_diag_
#define SAMG2_SET_EPS_LSQ samg2_set_eps_lsq_
#define SAMG2_GET_EPS_LSQ samg2_get_eps_lsq_
#define SAMG2_SET_ETR samg2_set_etr_
#define SAMG2_GET_ETR samg2_get_etr_
#define SAMG2_SET_ETR_DEFAULT samg2_set_etr_default_
#define SAMG2_GET_ETR_DEFAULT samg2_get_etr_default_
#define SAMG2_SET_ETR2_SMO samg2_set_etr2_smo_
#define SAMG2_GET_ETR2_SMO samg2_get_etr2_smo_
#define SAMG2_SET_EWT samg2_set_ewt_
#define SAMG2_GET_EWT samg2_get_ewt_
#define SAMG2_SET_EWT_DEFAULT samg2_set_ewt_default_
#define SAMG2_GET_EWT_DEFAULT samg2_get_ewt_default_
#define SAMG2_SET_FACTOR_APP_VAR samg2_set_factor_app_var_
#define SAMG2_GET_FACTOR_APP_VAR samg2_get_factor_app_var_
#define SAMG2_SET_FACTOR_QUASI_RES samg2_set_factor_quasi_res_
#define SAMG2_GET_FACTOR_QUASI_RES samg2_get_factor_quasi_res_
#define SAMG2_SET_FACTOR_RES_VAR samg2_set_factor_res_var_
#define SAMG2_GET_FACTOR_RES_VAR samg2_get_factor_res_var_
#define SAMG2_SET_FACTOR_MATRIX_SCALE samg2_set_factor_matrix_scale_
#define SAMG2_GET_FACTOR_MATRIX_SCALE samg2_get_factor_matrix_scale_
#define SAMG2_SET_FACTOR_SOL_JAC_UZAWA samg2_set_factor_sol_jac_uzawa_
#define SAMG2_GET_FACTOR_SOL_JAC_UZAWA samg2_get_factor_sol_jac_uzawa_
#define SAMG2_ISET_FILNAM samg2_iset_filnam_
#define SAMG2_IGET_FILNAM samg2_iget_filnam_
#define SAMG2_SET_FILNAM samg2_set_filnam_
#define SAMG2_GET_FILNAM samg2_get_filnam_
#define SAMG2_ISET_FILNAM_DUMPSOL samg2_iset_filnam_dumpsol_
#define SAMG2_IGET_FILNAM_DUMPSOL samg2_iget_filnam_dumpsol_
#define SAMG2_SET_FILNAM_DUMPSOL samg2_set_filnam_dumpsol_
#define SAMG2_GET_FILNAM_DUMPSOL samg2_get_filnam_dumpsol_
#define SAMG2_ISET_FILNAM_DUMP samg2_iset_filnam_dump_
#define SAMG2_IGET_FILNAM_DUMP samg2_iget_filnam_dump_
#define SAMG2_SET_FILNAM_DUMP samg2_set_filnam_dump_
#define SAMG2_GET_FILNAM_DUMP samg2_get_filnam_dump_
#define SAMG2_ISET_FILNAM_UZAWA samg2_iset_filnam_uzawa_
#define SAMG2_IGET_FILNAM_UZAWA samg2_iget_filnam_uzawa_
#define SAMG2_SET_FILNAM_UZAWA samg2_set_filnam_uzawa_
#define SAMG2_GET_FILNAM_UZAWA samg2_get_filnam_uzawa_
#define SAMG2_SET_FLEX_PCG_LITE samg2_set_flex_pcg_lite_
#define SAMG2_GET_FLEX_PCG_LITE samg2_get_flex_pcg_lite_
#define SAMG2_SET_FORCE_ACCEL samg2_set_force_accel_
#define SAMG2_GET_FORCE_ACCEL samg2_get_force_accel_
#define SAMG2_SET_FORCE_ACCEL_2ND samg2_set_force_accel_2nd_
#define SAMG2_GET_FORCE_ACCEL_2ND samg2_get_force_accel_2nd_
#define SAMG2_SET_FULL_PIVOTING samg2_set_full_pivoting_
#define SAMG2_GET_FULL_PIVOTING samg2_get_full_pivoting_
#define SAMG2_SET_FULL_SETUP samg2_set_full_setup_
#define SAMG2_GET_FULL_SETUP samg2_get_full_setup_
#define SAMG2_SET_G_CMPLX_AGG_DEFAULT samg2_set_g_cmplx_agg_default_
#define SAMG2_GET_G_CMPLX_AGG_DEFAULT samg2_get_g_cmplx_agg_default_
#define SAMG2_SET_G_CMPLX_DEFAULT samg2_set_g_cmplx_default_
#define SAMG2_GET_G_CMPLX_DEFAULT samg2_get_g_cmplx_default_
#define SAMG2_SET_GALERKIN_TIMER samg2_set_galerkin_timer_
#define SAMG2_GET_GALERKIN_TIMER samg2_get_galerkin_timer_
#define SAMG2_SET_GLK_MULT_ZEROS samg2_set_glk_mult_zeros_
#define SAMG2_GET_GLK_MULT_ZEROS samg2_get_glk_mult_zeros_
#define SAMG2_SET_GMAX_MULTIPASS samg2_set_gmax_multipass_
#define SAMG2_GET_GMAX_MULTIPASS samg2_get_gmax_multipass_
#define SAMG2_SET_IAGGREGATION_PROFILE samg2_set_iaggregation_profile_
#define SAMG2_GET_IAGGREGATION_PROFILE samg2_get_iaggregation_profile_
#define SAMG2_SET_IAGGREGATION samg2_set_iaggregation_
#define SAMG2_GET_IAGGREGATION samg2_get_iaggregation_
#define SAMG2_SET_IALL_SMO samg2_set_iall_smo_
#define SAMG2_GET_IALL_SMO samg2_get_iall_smo_
#define SAMG2_SET_IAUTO_OMEGA_JACOBI samg2_set_iauto_omega_jacobi_
#define SAMG2_GET_IAUTO_OMEGA_JACOBI samg2_get_iauto_omega_jacobi_
#define SAMG2_SET_IAUTO_OMEGA_SMOAGG samg2_set_iauto_omega_smoagg_
#define SAMG2_GET_IAUTO_OMEGA_SMOAGG samg2_get_iauto_omega_smoagg_
#define SAMG2_SET_IAUTO_STOP samg2_set_iauto_stop_
#define SAMG2_GET_IAUTO_STOP samg2_get_iauto_stop_
#define SAMG2_SET_IDUMP_SEQUENCE_START samg2_set_idump_sequence_start_
#define SAMG2_GET_IDUMP_SEQUENCE_START samg2_get_idump_sequence_start_
#define SAMG2_SET_IDUMP_SEQUENCE_END samg2_set_idump_sequence_end_
#define SAMG2_GET_IDUMP_SEQUENCE_END samg2_get_idump_sequence_end_
#define SAMG2_SET_ISTAB_CG samg2_set_istab_cg_
#define SAMG2_GET_ISTAB_CG samg2_get_istab_cg_
#define SAMG2_SET_IELASTICITY_PROFILE samg2_set_ielasticity_profile_
#define SAMG2_GET_IELASTICITY_PROFILE samg2_get_ielasticity_profile_
#define SAMG2_SET_IELASTICITY samg2_set_ielasticity_
#define SAMG2_GET_IELASTICITY samg2_get_ielasticity_
#define SAMG2_SET_IESTIM_SPECT_RADIUS samg2_set_iestim_spect_radius_
#define SAMG2_GET_IESTIM_SPECT_RADIUS samg2_get_iestim_spect_radius_
#define SAMG2_SET_IESTIM_SMOOTH_NIT samg2_set_iestim_smooth_nit_
#define SAMG2_GET_IESTIM_SMOOTH_NIT samg2_get_iestim_smooth_nit_
#define SAMG2_SET_INIT_RES_TREATMENT samg2_set_init_res_treatment_
#define SAMG2_GET_INIT_RES_TREATMENT samg2_get_init_res_treatment_
#define SAMG2_SET_IPRNT_RES_ACCURACY samg2_set_iprnt_res_accuracy_
#define SAMG2_GET_IPRNT_RES_ACCURACY samg2_get_iprnt_res_accuracy_
#define SAMG2_SET_ISMO2DFL samg2_set_ismo2dfl_
#define SAMG2_GET_ISMO2DFL samg2_get_ismo2dfl_
#define SAMG2_SET_ISMOAGG_AGGRESSIVE samg2_set_ismoagg_aggressive_
#define SAMG2_GET_ISMOAGG_AGGRESSIVE samg2_get_ismoagg_aggressive_
#define SAMG2_SET_ISMOAGG_OVERCORRECTION samg2_set_ismoagg_overcorrection_
#define SAMG2_GET_ISMOAGG_OVERCORRECTION samg2_get_ismoagg_overcorrection_
#define SAMG2_SET_ISMOAGG_OPTIM samg2_set_ismoagg_optim_
#define SAMG2_GET_ISMOAGG_OPTIM samg2_get_ismoagg_optim_
#define SAMG2_SET_ISMOAGG_BLOCK_TYP samg2_set_ismoagg_block_typ_
#define SAMG2_GET_ISMOAGG_BLOCK_TYP samg2_get_ismoagg_block_typ_
#define SAMG2_SET_ISMOAGG_COMPRESSION samg2_set_ismoagg_compression_
#define SAMG2_GET_ISMOAGG_COMPRESSION samg2_get_ismoagg_compression_
#define SAMG2_SET_ISMOAGG_FILTER_TYP samg2_set_ismoagg_filter_typ_
#define SAMG2_GET_ISMOAGG_FILTER_TYP samg2_get_ismoagg_filter_typ_
#define SAMG2_SET_ISMOAGG_SMOOTH_TYP samg2_set_ismoagg_smooth_typ_
#define SAMG2_GET_ISMOAGG_SMOOTH_TYP samg2_get_ismoagg_smooth_typ_
#define SAMG2_SET_ISMOAGG_SMOOTH_NIT samg2_set_ismoagg_smooth_nit_
#define SAMG2_GET_ISMOAGG_SMOOTH_NIT samg2_get_ismoagg_smooth_nit_
#define SAMG2_SET_ISMOAGG_SMOOTH_1LEV samg2_set_ismoagg_smooth_1lev_
#define SAMG2_GET_ISMOAGG_SMOOTH_1LEV samg2_get_ismoagg_smooth_1lev_
#define SAMG2_SET_ISMOAGG_SMOOTH_NLEV samg2_set_ismoagg_smooth_nlev_
#define SAMG2_GET_ISMOAGG_SMOOTH_NLEV samg2_get_ismoagg_smooth_nlev_
#define SAMG2_SET_IB_CMPLX samg2_set_ib_cmplx_
#define SAMG2_GET_IB_CMPLX samg2_get_ib_cmplx_
#define SAMG2_SET_IB_CMPLX_AGG_DEFAULT samg2_set_ib_cmplx_agg_default_
#define SAMG2_GET_IB_CMPLX_AGG_DEFAULT samg2_get_ib_cmplx_agg_default_
#define SAMG2_SET_IB_CMPLX_DEFAULT samg2_set_ib_cmplx_default_
#define SAMG2_GET_IB_CMPLX_DEFAULT samg2_get_ib_cmplx_default_
#define SAMG2_SET_IBGS_PIVOT samg2_set_ibgs_pivot_
#define SAMG2_GET_IBGS_PIVOT samg2_get_ibgs_pivot_
#define SAMG2_SET_ICASE_JAC_UZAWA samg2_set_icase_jac_uzawa_
#define SAMG2_GET_ICASE_JAC_UZAWA samg2_get_icase_jac_uzawa_
#define SAMG2_SET_ISTATISTICS_SMOVEC samg2_set_istatistics_smovec_
#define SAMG2_GET_ISTATISTICS_SMOVEC samg2_get_istatistics_smovec_
#define SAMG2_SET_ICHECK_SMOINT samg2_set_icheck_smoint_
#define SAMG2_GET_ICHECK_SMOINT samg2_get_icheck_smoint_
#define SAMG2_SET_ICOLOR_OMP samg2_set_icolor_omp_
#define SAMG2_GET_ICOLOR_OMP samg2_get_icolor_omp_
#define SAMG2_SET_IORDERED_OMP samg2_set_iordered_omp_
#define SAMG2_GET_IORDERED_OMP samg2_get_iordered_omp_
#define SAMG2_SET_ICRITS samg2_set_icrits_
#define SAMG2_GET_ICRITS samg2_get_icrits_
#define SAMG2_SET_IDTEST_UZAWA samg2_set_idtest_uzawa_
#define SAMG2_GET_IDTEST_UZAWA samg2_get_idtest_uzawa_
#define SAMG2_SET_IHUGE samg2_set_ihuge_
#define SAMG2_GET_IHUGE samg2_get_ihuge_
#define SAMG2_SET_IJAC_UZAWA samg2_set_ijac_uzawa_
#define SAMG2_GET_IJAC_UZAWA samg2_get_ijac_uzawa_
#define SAMG2_SET_ILU4ALLSCHWARZ samg2_set_ilu4allschwarz_
#define SAMG2_GET_ILU4ALLSCHWARZ samg2_get_ilu4allschwarz_
#define SAMG2_SET_ILU_SPEED samg2_set_ilu_speed_
#define SAMG2_GET_ILU_SPEED samg2_get_ilu_speed_
#define SAMG2_SET_IMPLDO_READ_WRITE_LEN samg2_set_impldo_read_write_len_
#define SAMG2_GET_IMPLDO_READ_WRITE_LEN samg2_get_impldo_read_write_len_
#define SAMG2_SET_INFO_KEEPMEM samg2_set_info_keepmem_
#define SAMG2_GET_INFO_KEEPMEM samg2_get_info_keepmem_
#define SAMG2_SET_INNER_ACCEL samg2_set_inner_accel_
#define SAMG2_GET_INNER_ACCEL samg2_get_inner_accel_
#define SAMG2_SET_IODUMP samg2_set_iodump_
#define SAMG2_GET_IODUMP samg2_get_iodump_
#define SAMG2_ISET_IOFILE_OPTA samg2_iset_iofile_opta_
#define SAMG2_IGET_IOFILE_OPTA samg2_iget_iofile_opta_
#define SAMG2_SET_IOFILE_OPTA samg2_set_iofile_opta_
#define SAMG2_GET_IOFILE_OPTA samg2_get_iofile_opta_
#define SAMG2_ISET_IOFORM samg2_iset_ioform_
#define SAMG2_IGET_IOFORM samg2_iget_ioform_
#define SAMG2_SET_IOFORM samg2_set_ioform_
#define SAMG2_GET_IOFORM samg2_get_ioform_
#define SAMG2_SET_IOGRID samg2_set_iogrid_
#define SAMG2_GET_IOGRID samg2_get_iogrid_
#define SAMG2_SET_IOMOVIE samg2_set_iomovie_
#define SAMG2_GET_IOMOVIE samg2_get_iomovie_
#define SAMG2_SET_IOSCRATCH_DEFAULT samg2_set_ioscratch_default_
#define SAMG2_GET_IOSCRATCH_DEFAULT samg2_get_ioscratch_default_
#define SAMG2_SET_IOUNIT_OPTA samg2_set_iounit_opta_
