openCSMP/openCSMP/lib/samg/samg2.h
#define SAMG2_GET_IOUNIT_OPTA samg2_get_iounit_opta_
#define SAMG2_SET_IPASS_MAX_SET samg2_set_ipass_max_set_
#define SAMG2_GET_IPASS_MAX_SET samg2_get_ipass_max_set_
#define SAMG2_SET_IRESTRICTION_OPENMP samg2_set_irestriction_openmp_
#define SAMG2_GET_IRESTRICTION_OPENMP samg2_get_irestriction_openmp_
#define SAMG2_SET_IPRESSURE_UZAWA samg2_set_ipressure_uzawa_
#define SAMG2_GET_IPRESSURE_UZAWA samg2_get_ipressure_uzawa_
#define SAMG2_SET_IPROFILE_GEOMETRIC samg2_set_iprofile_geometric_
#define SAMG2_GET_IPROFILE_GEOMETRIC samg2_get_iprofile_geometric_
#define SAMG2_SET_ISAT_UZAWA samg2_set_isat_uzawa_
#define SAMG2_GET_ISAT_UZAWA samg2_get_isat_uzawa_
#define SAMG2_SET_ISET_VIO_DD samg2_set_iset_vio_dd_
#define SAMG2_GET_ISET_VIO_DD samg2_get_iset_vio_dd_
#define SAMG2_SET_ISSTEP_UZAWA samg2_set_isstep_uzawa_
#define SAMG2_GET_ISSTEP_UZAWA samg2_get_isstep_uzawa_
#define SAMG2_SET_ISTEP1CASE_UZAWA samg2_set_istep1case_uzawa_
#define SAMG2_GET_ISTEP1CASE_UZAWA samg2_get_istep1case_uzawa_
#define SAMG2_SET_ISTEERING samg2_set_isteering_
#define SAMG2_GET_ISTEERING samg2_get_isteering_
#define SAMG2_SET_ISWIT3_USER samg2_set_iswit3_user_
#define SAMG2_GET_ISWIT3_USER samg2_get_iswit3_user_
#define SAMG2_SET_ITER_CHECK samg2_set_iter_check_
#define SAMG2_GET_ITER_CHECK samg2_get_iter_check_
#define SAMG2_SET_ITER_MATRIX_SCALE samg2_set_iter_matrix_scale_
#define SAMG2_GET_ITER_MATRIX_SCALE samg2_get_iter_matrix_scale_
#define SAMG2_SET_ITER_PRE samg2_set_iter_pre_
#define SAMG2_GET_ITER_PRE samg2_get_iter_pre_
#define SAMG2_SET_ITMAX_CONV samg2_set_itmax_conv_
#define SAMG2_GET_ITMAX_CONV samg2_get_itmax_conv_
#define SAMG2_SET_ITRACE_AMGMAIN samg2_set_itrace_amgmain_
#define SAMG2_GET_ITRACE_AMGMAIN samg2_get_itrace_amgmain_
#define SAMG2_SET_ITRACELEVEL samg2_set_itracelevel_
#define SAMG2_GET_ITRACELEVEL samg2_get_itracelevel_
#define SAMG2_SET_ITRACE_CLSOL samg2_set_itrace_clsol_
#define SAMG2_GET_ITRACE_CLSOL samg2_get_itrace_clsol_
#define SAMG2_SET_ITRACE_CLDENSE samg2_set_itrace_cldense_
#define SAMG2_GET_ITRACE_CLDENSE samg2_get_itrace_cldense_
#define SAMG2_SET_ITRACE_DIVSTOP samg2_set_itrace_divstop_
#define SAMG2_GET_ITRACE_DIVSTOP samg2_get_itrace_divstop_
#define SAMG2_SET_ITRACE_JAC_UZAWA samg2_set_itrace_jac_uzawa_
#define SAMG2_GET_ITRACE_JAC_UZAWA samg2_get_itrace_jac_uzawa_
#define SAMG2_SET_ITRACE_MK_REGULAR samg2_set_itrace_mk_regular_
#define SAMG2_GET_ITRACE_MK_REGULAR samg2_get_itrace_mk_regular_
#define SAMG2_SET_ITRACE_MATRIX_MODE samg2_set_itrace_matrix_mode_
#define SAMG2_GET_ITRACE_MATRIX_MODE samg2_get_itrace_matrix_mode_
#define SAMG2_SET_ITRACE_MATRIX_STORAGE samg2_set_itrace_matrix_storage_
#define SAMG2_GET_ITRACE_MATRIX_STORAGE samg2_get_itrace_matrix_storage_
#define SAMG2_SET_ITRACE_SCHWARZ samg2_set_itrace_schwarz_
#define SAMG2_GET_ITRACE_SCHWARZ samg2_get_itrace_schwarz_
#define SAMG2_SET_ITRACE_SMO samg2_set_itrace_smo_
#define SAMG2_GET_ITRACE_SMO samg2_get_itrace_smo_
#define SAMG2_SET_ITRACE_SOL samg2_set_itrace_sol_
#define SAMG2_GET_ITRACE_SOL samg2_get_itrace_sol_
#define SAMG2_SET_ITRACE_SPLIT samg2_set_itrace_split_
#define SAMG2_GET_ITRACE_SPLIT samg2_get_itrace_split_
#define SAMG2_SET_ITRACE_UZAWA samg2_set_itrace_uzawa_
#define SAMG2_GET_ITRACE_UZAWA samg2_get_itrace_uzawa_
#define SAMG2_SET_SMOAGG_NOQR samg2_set_smoagg_noqr_
#define SAMG2_GET_SMOAGG_NOQR samg2_get_smoagg_noqr_
#define SAMG2_SET_STACKTRACE samg2_set_stacktrace_
#define SAMG2_GET_STACKTRACE samg2_get_stacktrace_
#define SAMG2_SET_STORE_PGS_FACTOR samg2_set_store_pgs_factor_
#define SAMG2_GET_STORE_PGS_FACTOR samg2_get_store_pgs_factor_
#define SAMG2_SET_KCYCLE_PROFILE samg2_set_kcycle_profile_
#define SAMG2_GET_KCYCLE_PROFILE samg2_get_kcycle_profile_
#define SAMG2_SET_KEEPMEM samg2_set_keepmem_
#define SAMG2_GET_KEEPMEM samg2_get_keepmem_
#define SAMG2_SET_K_DISABLE_KRYLOV1 samg2_set_k_disable_krylov1_
#define SAMG2_GET_K_DISABLE_KRYLOV1 samg2_get_k_disable_krylov1_
#define SAMG2_SET_K_DYNCYC samg2_set_k_dyncyc_
#define SAMG2_GET_K_DYNCYC samg2_get_k_dyncyc_
#define SAMG2_SET_LASTGRID samg2_set_lastgrid_
#define SAMG2_GET_LASTGRID samg2_get_lastgrid_
#define SAMG2_SET_LEV_COARSENING_TOO_SLOW samg2_set_lev_coarsening_too_slow_
#define SAMG2_GET_LEV_COARSENING_TOO_SLOW samg2_get_lev_coarsening_too_slow_
#define SAMG2_SET_LEVELS_UZAWA samg2_set_levels_uzawa_
#define SAMG2_GET_LEVELS_UZAWA samg2_get_levels_uzawa_
#define SAMG2_SET_LEVELX samg2_set_levelx_
#define SAMG2_GET_LEVELX samg2_get_levelx_
#define SAMG2_SET_LEVELX_2ND samg2_set_levelx_2nd_
#define SAMG2_GET_LEVELX_2ND samg2_get_levelx_2nd_
#define SAMG2_SET_LFIL_CL samg2_set_lfil_cl_
#define SAMG2_GET_LFIL_CL samg2_get_lfil_cl_
#define SAMG2_SET_LFIL_2ND samg2_set_lfil_2nd_
#define SAMG2_GET_LFIL_2ND samg2_get_lfil_2nd_
#define SAMG2_SET_LFIL_SMO samg2_set_lfil_smo_
#define SAMG2_GET_LFIL_SMO samg2_get_lfil_smo_
#define SAMG2_ISET_LOGFILE samg2_iset_logfile_
#define SAMG2_IGET_LOGFILE samg2_iget_logfile_
#define SAMG2_SET_LOGFILE samg2_set_logfile_
#define SAMG2_GET_LOGFILE samg2_get_logfile_
#define SAMG2_SET_LOGIO samg2_set_logio_
#define SAMG2_GET_LOGIO samg2_get_logio_
#define SAMG2_SET_LU_REUSE samg2_set_lu_reuse_
#define SAMG2_GET_LU_REUSE samg2_get_lu_reuse_
#define SAMG2_SET_MATRIX_MODE samg2_set_matrix_mode_
#define SAMG2_GET_MATRIX_MODE samg2_get_matrix_mode_
#define SAMG2_SET_MATRIX_FORMAT samg2_set_matrix_format_
#define SAMG2_GET_MATRIX_FORMAT samg2_get_matrix_format_
#define SAMG2_SET_MATRIX_SCALE_RENORM samg2_set_matrix_scale_renorm_
#define SAMG2_GET_MATRIX_SCALE_RENORM samg2_get_matrix_scale_renorm_
#define SAMG2_SET_MAX_CALLS samg2_set_max_calls_
#define SAMG2_GET_MAX_CALLS samg2_get_max_calls_
#define SAMG2_SET_MAX_CL_SIZE samg2_set_max_cl_size_
#define SAMG2_GET_MAX_CL_SIZE samg2_get_max_cl_size_
#define SAMG2_SET_MAXCORR_CLUSTER samg2_set_maxcorr_cluster_
#define SAMG2_GET_MAXCORR_CLUSTER samg2_get_maxcorr_cluster_
#define SAMG2_SET_MAX_LEVEL samg2_set_max_level_
#define SAMG2_GET_MAX_LEVEL samg2_get_max_level_
#define SAMG2_SET_MAX_NB_LIST_SIZE samg2_set_max_nb_list_size_
#define SAMG2_GET_MAX_NB_LIST_SIZE samg2_get_max_nb_list_size_
#define SAMG2_SET_MAXITER_JAC_UZAWA samg2_set_maxiter_jac_uzawa_
#define SAMG2_GET_MAXITER_JAC_UZAWA samg2_get_maxiter_jac_uzawa_
#define SAMG2_SET_MAXOP_RESTART samg2_set_maxop_restart_
#define SAMG2_GET_MAXOP_RESTART samg2_get_maxop_restart_
#define SAMG2_SET_MAXRETRY_JAC_UZAWA samg2_set_maxretry_jac_uzawa_
#define SAMG2_GET_MAXRETRY_JAC_UZAWA samg2_get_maxretry_jac_uzawa_
#define SAMG2_SET_MILU samg2_set_milu_
#define SAMG2_GET_MILU samg2_get_milu_
#define SAMG2_SET_MIN_CL_SIZE samg2_set_min_cl_size_
#define SAMG2_GET_MIN_CL_SIZE samg2_get_min_cl_size_
#define SAMG2_SET_MIN_MULTI_SIZE samg2_set_min_multi_size_
#define SAMG2_GET_MIN_MULTI_SIZE samg2_get_min_multi_size_
#define SAMG2_SET_MINITER_JAC_UZAWA samg2_set_miniter_jac_uzawa_
#define SAMG2_GET_MINITER_JAC_UZAWA samg2_get_miniter_jac_uzawa_
#define SAMG2_SET_MK_REGULAR samg2_set_mk_regular_
#define SAMG2_GET_MK_REGULAR samg2_get_mk_regular_
#define SAMG2_SET_MODE_CNTRL samg2_set_mode_cntrl_
#define SAMG2_GET_MODE_CNTRL samg2_get_mode_cntrl_
#define SAMG2_SET_MODE_DEBUG samg2_set_mode_debug_
#define SAMG2_GET_MODE_DEBUG samg2_get_mode_debug_
#define SAMG2_SET_MODE_MESS samg2_set_mode_mess_
#define SAMG2_GET_MODE_MESS samg2_get_mode_mess_
#define SAMG2_SET_MODIFY_MAT samg2_set_modify_mat_
#define SAMG2_GET_MODIFY_MAT samg2_get_modify_mat_
#define SAMG2_SET_MODIFY_RESTRICTION samg2_set_modify_restriction_
#define SAMG2_GET_MODIFY_RESTRICTION samg2_get_modify_restriction_
#define SAMG2_SET_MULTIPASS_ALLCOUP samg2_set_multipass_allcoup_
#define SAMG2_GET_MULTIPASS_ALLCOUP samg2_get_multipass_allcoup_
#define SAMG2_SET_NBLK_DEBUG samg2_set_nblk_debug_
#define SAMG2_GET_NBLK_DEBUG samg2_get_nblk_debug_
#define SAMG2_SET_NBLK_MAX samg2_set_nblk_max_
#define SAMG2_GET_NBLK_MAX samg2_get_nblk_max_
#define SAMG2_SET_NBLK_OVERLAP samg2_set_nblk_overlap_
#define SAMG2_GET_NBLK_OVERLAP samg2_get_nblk_overlap_
#define SAMG2_SET_NBLK_RESID samg2_set_nblk_resid_
#define SAMG2_GET_NBLK_RESID samg2_get_nblk_resid_
#define SAMG2_SET_NBLK_SOLVE samg2_set_nblk_solve_
#define SAMG2_GET_NBLK_SOLVE samg2_get_nblk_solve_
#define SAMG2_SET_NBLK_SOLVER samg2_set_nblk_solver_
#define SAMG2_GET_NBLK_SOLVER samg2_get_nblk_solver_
#define SAMG2_SET_NBND_OMEGA samg2_set_nbnd_omega_
#define SAMG2_GET_NBND_OMEGA samg2_get_nbnd_omega_
#define SAMG2_SET_NBND_OMEGA_UZAWA samg2_set_nbnd_omega_uzawa_
#define SAMG2_GET_NBND_OMEGA_UZAWA samg2_get_nbnd_omega_uzawa_
#define SAMG2_SET_NBND_SWEEPS samg2_set_nbnd_sweeps_
#define SAMG2_GET_NBND_SWEEPS samg2_get_nbnd_sweeps_
#define SAMG2_SET_NBND_SWEEPS_UZAWA samg2_set_nbnd_sweeps_uzawa_
#define SAMG2_GET_NBND_SWEEPS_UZAWA samg2_get_nbnd_sweeps_uzawa_
#define SAMG2_SET_NCOLOR_BLOCK_GS samg2_set_ncolor_block_gs_
#define SAMG2_GET_NCOLOR_BLOCK_GS samg2_get_ncolor_block_gs_
#define SAMG2_SET_NCOLOR_BLOCK_GS_MSG samg2_set_ncolor_block_gs_msg_
#define SAMG2_GET_NCOLOR_BLOCK_GS_MSG samg2_get_ncolor_block_gs_msg_
#define SAMG2_SET_NCOLOR_BLOCK_GS_RESCHK samg2_set_ncolor_block_gs_reschk_
#define SAMG2_GET_NCOLOR_BLOCK_GS_RESCHK samg2_get_ncolor_block_gs_reschk_
#define SAMG2_SET_NDEGREE_CHEBY samg2_set_ndegree_cheby_
#define SAMG2_GET_NDEGREE_CHEBY samg2_get_ndegree_cheby_
#define SAMG2_SET_NCFRAMES samg2_set_ncframes_
#define SAMG2_GET_NCFRAMES samg2_get_ncframes_
#define SAMG2_SET_NCG samg2_set_ncg_
#define SAMG2_GET_NCG samg2_get_ncg_
#define SAMG2_SET_NCGRAD_DEFAULT samg2_set_ncgrad_default_
#define SAMG2_GET_NCGRAD_DEFAULT samg2_get_ncgrad_default_
#define SAMG2_SET_NCYC_DEFAULT samg2_set_ncyc_default_
#define SAMG2_GET_NCYC_DEFAULT samg2_get_ncyc_default_
#define SAMG2_SET_NCYC_MIN samg2_set_ncyc_min_
#define SAMG2_GET_NCYC_MIN samg2_get_ncyc_min_
#define SAMG2_SET_NCYC_2ND samg2_set_ncyc_2nd_
#define SAMG2_GET_NCYC_2ND samg2_get_ncyc_2nd_
#define SAMG2_SET_NCYC_START samg2_set_ncyc_start_
#define SAMG2_GET_NCYC_START samg2_get_ncyc_start_
#define SAMG2_SET_NDYN_SMO samg2_set_ndyn_smo_
#define SAMG2_GET_NDYN_SMO samg2_get_ndyn_smo_
#define SAMG2_SET_NEG_DIAG samg2_set_neg_diag_
#define SAMG2_GET_NEG_DIAG samg2_get_neg_diag_
#define SAMG2_SET_NEG_DIAG_BRUTE samg2_set_neg_diag_brute_
#define SAMG2_GET_NEG_DIAG_BRUTE samg2_get_neg_diag_brute_
#define SAMG2_SET_NEW_ENTRIES samg2_set_new_entries_
#define SAMG2_GET_NEW_ENTRIES samg2_get_new_entries_
#define SAMG2_SET_NEW_TOPOLOGY samg2_set_new_topology_
#define SAMG2_GET_NEW_TOPOLOGY samg2_get_new_topology_
#define SAMG2_SET_NILU_REORDER samg2_set_nilu_reorder_
#define SAMG2_GET_NILU_REORDER samg2_get_nilu_reorder_
#define SAMG2_SET_NINCR_RES_ACCEPTED_MG samg2_set_nincr_res_accepted_mg_
#define SAMG2_GET_NINCR_RES_ACCEPTED_MG samg2_get_nincr_res_accepted_mg_
#define SAMG2_SET_NINCR_RES_ACCEPTED_1G samg2_set_nincr_res_accepted_1g_
#define SAMG2_GET_NINCR_RES_ACCEPTED_1G samg2_get_nincr_res_accepted_1g_
#define SAMG2_SET_NINT_ROWSUM1 samg2_set_nint_rowsum1_
#define SAMG2_GET_NINT_ROWSUM1 samg2_get_nint_rowsum1_
#define SAMG2_SET_NINTER_OMP samg2_set_ninter_omp_
#define SAMG2_GET_NINTER_OMP samg2_get_ninter_omp_
#define SAMG2_SET_NITER_SKIP samg2_set_niter_skip_
#define SAMG2_GET_NITER_SKIP samg2_get_niter_skip_
#define SAMG2_SET_NKCYCLE samg2_set_nkcycle_
#define SAMG2_GET_NKCYCLE samg2_get_nkcycle_
#define SAMG2_SET_NKDIM_DEFAULT samg2_set_nkdim_default_
#define SAMG2_GET_NKDIM_DEFAULT samg2_get_nkdim_default_
#define SAMG2_SET_NSMOOTH_COO_POLY samg2_set_nsmooth_coo_poly_
#define SAMG2_GET_NSMOOTH_COO_POLY samg2_get_nsmooth_coo_poly_
#define SAMG2_SET_NSMOAGG samg2_set_nsmoagg_
#define SAMG2_GET_NSMOAGG samg2_get_nsmoagg_
#define SAMG2_SET_NSMOAGG1LEV samg2_set_nsmoagg1lev_
#define SAMG2_GET_NSMOAGG1LEV samg2_get_nsmoagg1lev_
#define SAMG2_SET_NSMOAGGLEV samg2_set_nsmoagglev_
#define SAMG2_GET_NSMOAGGLEV samg2_get_nsmoagglev_
#define SAMG2_SET_NMIN_MATRIX samg2_set_nmin_matrix_
#define SAMG2_GET_NMIN_MATRIX samg2_get_nmin_matrix_
#define SAMG2_SET_NMIN_MATRIX_RESC samg2_set_nmin_matrix_resc_
#define SAMG2_GET_NMIN_MATRIX_RESC samg2_get_nmin_matrix_resc_
#define SAMG2_SET_NMIN_VECTOR samg2_set_nmin_vector_
#define SAMG2_GET_NMIN_VECTOR samg2_get_nmin_vector_
#define SAMG2_SET_NOTALLUNS_CHEAP samg2_set_notalluns_cheap_
#define SAMG2_GET_NOTALLUNS_CHEAP samg2_get_notalluns_cheap_
#define SAMG2_SET_NP_MOD1 samg2_set_np_mod1_
#define SAMG2_GET_NP_MOD1 samg2_get_np_mod1_
#define SAMG2_SET_NP_MOD2 samg2_set_np_mod2_
#define SAMG2_GET_NP_MOD2 samg2_get_np_mod2_
#define SAMG2_SET_NP_OPT samg2_set_np_opt_
#define SAMG2_GET_NP_OPT samg2_get_np_opt_
#define SAMG2_SET_NPRIM_AT_ALLPNTS samg2_set_nprim_at_allpnts_
#define SAMG2_GET_NPRIM_AT_ALLPNTS samg2_get_nprim_at_allpnts_
#define SAMG2_SET_NPTMAX samg2_set_nptmax_
#define SAMG2_GET_NPTMAX samg2_get_nptmax_
#define SAMG2_SET_NPTMN samg2_set_nptmn_
#define SAMG2_GET_NPTMN samg2_get_nptmn_
#define SAMG2_SET_NRC samg2_set_nrc_
#define SAMG2_GET_NRC samg2_get_nrc_
#define SAMG2_SET_NRC_EMERGENCY samg2_set_nrc_emergency_
#define SAMG2_GET_NRC_EMERGENCY samg2_get_nrc_emergency_
#define SAMG2_SET_NRD samg2_set_nrd_
#define SAMG2_GET_NRD samg2_get_nrd_
#define SAMG2_SET_NRD_2ND samg2_set_nrd_2nd_
#define SAMG2_GET_NRD_2ND samg2_get_nrd_2nd_
#define SAMG2_SET_NRU samg2_set_nru_
#define SAMG2_GET_NRU samg2_get_nru_
#define SAMG2_SET_NRU_2ND samg2_set_nru_2nd_
#define SAMG2_GET_NRU_2ND samg2_get_nru_2nd_
#define SAMG2_SET_NSIMPLE_EMERGENCY samg2_set_nsimple_emergency_
#define SAMG2_GET_NSIMPLE_EMERGENCY samg2_get_nsimple_emergency_
#define SAMG2_SET_NSOLVE_DEFAULT samg2_set_nsolve_default_
#define SAMG2_GET_NSOLVE_DEFAULT samg2_get_nsolve_default_
#define SAMG2_SET_NSOLVE_2ND samg2_set_nsolve_2nd_
#define SAMG2_GET_NSOLVE_2ND samg2_get_nsolve_2nd_
#define SAMG2_SET_NSOLVE_UZAWA samg2_set_nsolve_uzawa_
#define SAMG2_GET_NSOLVE_UZAWA samg2_get_nsolve_uzawa_
#define SAMG2_SET_NSTAR_TYP samg2_set_nstar_typ_
#define SAMG2_GET_NSTAR_TYP samg2_get_nstar_typ_
#define SAMG2_SET_NSW_OMEGA_UZAWA samg2_set_nsw_omega_uzawa_
#define SAMG2_GET_NSW_OMEGA_UZAWA samg2_get_nsw_omega_uzawa_
#define SAMG2_SET_NSW_UZAWA samg2_set_nsw_uzawa_
#define SAMG2_GET_NSW_UZAWA samg2_get_nsw_uzawa_
#define SAMG2_SET_NTAKE_RES_IN samg2_set_ntake_res_in_
#define SAMG2_GET_NTAKE_RES_IN samg2_get_ntake_res_in_
#define SAMG2_SET_NTH_RES_SCRATCH samg2_set_nth_res_scratch_
#define SAMG2_GET_NTH_RES_SCRATCH samg2_get_nth_res_scratch_
#define SAMG2_SET_NTR samg2_set_ntr_
#define SAMG2_GET_NTR samg2_get_ntr_
#define SAMG2_SET_NTR_PRIM samg2_set_ntr_prim_
#define SAMG2_GET_NTR_PRIM samg2_get_ntr_prim_
#define SAMG2_SET_NTYP_ACCEL samg2_set_ntyp_accel_
#define SAMG2_GET_NTYP_ACCEL samg2_get_ntyp_accel_
#define SAMG2_SET_NTYP_GALERKIN samg2_set_ntyp_galerkin_
#define SAMG2_GET_NTYP_GALERKIN samg2_get_ntyp_galerkin_
#define SAMG2_SET_NUMTRY_MAX_SET samg2_set_numtry_max_set_
#define SAMG2_GET_NUMTRY_MAX_SET samg2_get_numtry_max_set_
#define SAMG2_SET_NVERSION samg2_set_nversion_
#define SAMG2_GET_NVERSION samg2_get_nversion_
#define SAMG2_SET_NWT samg2_set_nwt_
#define SAMG2_GET_NWT samg2_get_nwt_
#define SAMG2_SET_NXTYP_COARSE samg2_set_nxtyp_coarse_
#define SAMG2_GET_NXTYP_COARSE samg2_get_nxtyp_coarse_
#define SAMG2_SET_OIL_ACCEL samg2_set_oil_accel_
#define SAMG2_GET_OIL_ACCEL samg2_get_oil_accel_
#define SAMG2_SET_OIL_GPRS samg2_set_oil_gprs_
#define SAMG2_GET_OIL_GPRS samg2_get_oil_gprs_
#define SAMG2_SET_OIL_NOPRIM samg2_set_oil_noprim_
#define SAMG2_GET_OIL_NOPRIM samg2_get_oil_noprim_
#define SAMG2_SET_OMEGA_JAC_ES_UZAWA samg2_set_omega_jac_es_uzawa_
#define SAMG2_GET_OMEGA_JAC_ES_UZAWA samg2_get_omega_jac_es_uzawa_
#define SAMG2_SET_OMEGA_JAC_P_UZAWA samg2_set_omega_jac_p_uzawa_
#define SAMG2_GET_OMEGA_JAC_P_UZAWA samg2_get_omega_jac_p_uzawa_
#define SAMG2_SET_OMEGA_JACOBI samg2_set_omega_jacobi_
#define SAMG2_GET_OMEGA_JACOBI samg2_get_omega_jacobi_
#define SAMG2_SET_OMEGA_SOR_DO samg2_set_omega_sor_do_
#define SAMG2_GET_OMEGA_SOR_DO samg2_get_omega_sor_do_
#define SAMG2_SET_OMEGA_SOR_UP samg2_set_omega_sor_up_
#define SAMG2_GET_OMEGA_SOR_UP samg2_get_omega_sor_up_
#define SAMG2_SET_OMEGA_SMO samg2_set_omega_smo_
#define SAMG2_GET_OMEGA_SMO samg2_get_omega_smo_
#define SAMG2_SET_OMEGA_SMO_MIN samg2_set_omega_smo_min_
#define SAMG2_GET_OMEGA_SMO_MIN samg2_get_omega_smo_min_
#define SAMG2_SET_OMEGA_UZAWA samg2_set_omega_uzawa_
#define SAMG2_GET_OMEGA_UZAWA samg2_get_omega_uzawa_
#define SAMG2_SET_OMP_ILU samg2_set_omp_ilu_
#define SAMG2_GET_OMP_ILU samg2_get_omp_ilu_
#define SAMG2_ISET_OMP_PARTITION_FILE samg2_iset_omp_partition_file_
#define SAMG2_IGET_OMP_PARTITION_FILE samg2_iget_omp_partition_file_
#define SAMG2_SET_OMP_PARTITION_FILE samg2_set_omp_partition_file_
#define SAMG2_GET_OMP_PARTITION_FILE samg2_get_omp_partition_file_
#define SAMG2_SET_OMP_NUM_THREADS_EXTERNAL samg2_set_omp_num_threads_external_
#define SAMG2_GET_OMP_NUM_THREADS_EXTERNAL samg2_get_omp_num_threads_external_
#define SAMG2_SET_OMP_NTHREADS_ONLY4SPLIT samg2_set_omp_nthreads_only4split_
#define SAMG2_GET_OMP_NTHREADS_ONLY4SPLIT samg2_get_omp_nthreads_only4split_
#define SAMG2_SET_OMP_UZAWA samg2_set_omp_uzawa_
#define SAMG2_GET_OMP_UZAWA samg2_get_omp_uzawa_
#define SAMG2_SET_OPT_MATRIX_OPS samg2_set_opt_matrix_ops_
#define SAMG2_GET_OPT_MATRIX_OPS samg2_get_opt_matrix_ops_
#define SAMG2_SET_P_CMPLX_AGG_DEFAULT samg2_set_p_cmplx_agg_default_
#define SAMG2_GET_P_CMPLX_AGG_DEFAULT samg2_get_p_cmplx_agg_default_
#define SAMG2_SET_P_CMPLX_DEFAULT samg2_set_p_cmplx_default_
#define SAMG2_GET_P_CMPLX_DEFAULT samg2_get_p_cmplx_default_
#define SAMG2_SET_PARTIAL_FRAC samg2_set_partial_frac_
#define SAMG2_GET_PARTIAL_FRAC samg2_get_partial_frac_
#define SAMG2_ISET_PARTITION_FILE samg2_iset_partition_file_
#define SAMG2_IGET_PARTITION_FILE samg2_iget_partition_file_
#define SAMG2_SET_PARTITION_FILE samg2_set_partition_file_
#define SAMG2_GET_PARTITION_FILE samg2_get_partition_file_
#define SAMG2_SET_AMG_RENUMBER samg2_set_amg_renumber_
#define SAMG2_GET_AMG_RENUMBER samg2_get_amg_renumber_
#define SAMG2_ISET_AMG_RENUMBER_FILE samg2_iset_amg_renumber_file_
#define SAMG2_IGET_AMG_RENUMBER_FILE samg2_iget_amg_renumber_file_
#define SAMG2_SET_AMG_RENUMBER_FILE samg2_set_amg_renumber_file_
#define SAMG2_GET_AMG_RENUMBER_FILE samg2_get_amg_renumber_file_
#define SAMG2_ISET_DUMPFILE_RENUMBER samg2_iset_dumpfile_renumber_
#define SAMG2_IGET_DUMPFILE_RENUMBER samg2_iget_dumpfile_renumber_
#define SAMG2_SET_DUMPFILE_RENUMBER samg2_set_dumpfile_renumber_
#define SAMG2_GET_DUMPFILE_RENUMBER samg2_get_dumpfile_renumber_
#define SAMG2_SET_PERF_METER_ENABLED samg2_set_perf_meter_enabled_
#define SAMG2_GET_PERF_METER_ENABLED samg2_get_perf_meter_enabled_
#define SAMG2_SET_PRIM_NORM samg2_set_prim_norm_
#define SAMG2_GET_PRIM_NORM samg2_get_prim_norm_
#define SAMG2_SET_PRIM_PRINT samg2_set_prim_print_
#define SAMG2_GET_PRIM_PRINT samg2_get_prim_print_
#define SAMG2_SET_PRINT_NXTYP_COARSE_MSG samg2_set_print_nxtyp_coarse_msg_
#define SAMG2_GET_PRINT_NXTYP_COARSE_MSG samg2_get_print_nxtyp_coarse_msg_
#define SAMG2_SET_PRINT_SETUP_ILU_OR_DIRECT samg2_set_print_setup_ilu_or_direct_
#define SAMG2_GET_PRINT_SETUP_ILU_OR_DIRECT samg2_get_print_setup_ilu_or_direct_
#define SAMG2_SET_PRNT_STAT_SCHWARZ samg2_set_prnt_stat_schwarz_
#define SAMG2_GET_PRNT_STAT_SCHWARZ samg2_get_prnt_stat_schwarz_
#define SAMG2_SET_QUASI_ONLY samg2_set_quasi_only_
#define SAMG2_GET_QUASI_ONLY samg2_get_quasi_only_
#define SAMG2_SET_REDUCT_KCYCLE samg2_set_reduct_kcycle_
#define SAMG2_GET_REDUCT_KCYCLE samg2_get_reduct_kcycle_
#define SAMG2_SET_RBM_INTERN_INFO samg2_set_rbm_intern_info_
#define SAMG2_GET_RBM_INTERN_INFO samg2_get_rbm_intern_info_
#define SAMG2_SET_RCONDX samg2_set_rcondx_
#define SAMG2_GET_RCONDX samg2_get_rcondx_
#define SAMG2_SET_READ_UZAWA_PARMS samg2_set_read_uzawa_parms_
#define SAMG2_GET_READ_UZAWA_PARMS samg2_get_read_uzawa_parms_
#define SAMG2_SET_READ_MARIAN_COARSENING samg2_set_read_marian_coarsening_
#define SAMG2_GET_READ_MARIAN_COARSENING samg2_get_read_marian_coarsening_
#define SAMG2_SET_REFRESH_CALLED samg2_set_refresh_called_
#define SAMG2_GET_REFRESH_CALLED samg2_get_refresh_called_
#define SAMG2_SET_REL_APP_VAR samg2_set_rel_app_var_
#define SAMG2_GET_REL_APP_VAR samg2_get_rel_app_var_
#define SAMG2_SET_RHO_MIN samg2_set_rho_min_
#define SAMG2_GET_RHO_MIN samg2_get_rho_min_
#define SAMG2_SET_RHO_OK samg2_set_rho_ok_
#define SAMG2_GET_RHO_OK samg2_get_rho_ok_
#define SAMG2_SET_SHOW_UN_RES samg2_set_show_un_res_
#define SAMG2_GET_SHOW_UN_RES samg2_get_show_un_res_
#define SAMG2_ISET_SCRATCHFILE samg2_iset_scratchfile_
#define SAMG2_IGET_SCRATCHFILE samg2_iget_scratchfile_
#define SAMG2_SET_SCRATCHFILE samg2_set_scratchfile_
#define SAMG2_GET_SCRATCHFILE samg2_get_scratchfile_
#define SAMG2_SET_SLOW_COARSENING samg2_set_slow_coarsening_
#define SAMG2_GET_SLOW_COARSENING samg2_get_slow_coarsening_
#define SAMG2_SET_STABILITY samg2_set_stability_
#define SAMG2_GET_STABILITY samg2_get_stability_
#define SAMG2_SET_STRUCT_IDENT samg2_set_struct_ident_
#define SAMG2_GET_STRUCT_IDENT samg2_get_struct_ident_
#define SAMG2_SET_STRUCT_SYMM samg2_set_struct_symm_
#define SAMG2_GET_STRUCT_SYMM samg2_get_struct_symm_
#define SAMG2_SET_TAU_UZAWA samg2_set_tau_uzawa_
#define SAMG2_GET_TAU_UZAWA samg2_get_tau_uzawa_
#define SAMG2_SET_TERM_COARSENING samg2_set_term_coarsening_
#define SAMG2_GET_TERM_COARSENING samg2_get_term_coarsening_
#define SAMG2_SET_TRACE_L2_QUASI_RES samg2_set_trace_l2_quasi_res_
#define SAMG2_GET_TRACE_L2_QUASI_RES samg2_get_trace_l2_quasi_res_
#define SAMG2_SET_TRACKMEM samg2_set_trackmem_
#define SAMG2_GET_TRACKMEM samg2_get_trackmem_
#define SAMG2_SET_TRACKRESID samg2_set_trackresid_
#define SAMG2_GET_TRACKRESID samg2_get_trackresid_
#define SAMG2_SET_TRACK_AP_P samg2_set_track_ap_p_
#define SAMG2_GET_TRACK_AP_P samg2_get_track_ap_p_
#define SAMG2_SET_USE_IC samg2_set_use_ic_
#define SAMG2_GET_USE_IC samg2_get_use_ic_
#define SAMG2_SET_VIO_DD samg2_set_vio_dd_
#define SAMG2_GET_VIO_DD samg2_get_vio_dd_
#define SAMG2_SET_W_AVRGE_AGG_DEFAULT samg2_set_w_avrge_agg_default_
#define SAMG2_GET_W_AVRGE_AGG_DEFAULT samg2_get_w_avrge_agg_default_
#define SAMG2_SET_W_AVRGE_DEFAULT samg2_set_w_avrge_default_
#define SAMG2_GET_W_AVRGE_DEFAULT samg2_get_w_avrge_default_
#define SAMG2_SET_WCOUPLED samg2_set_wcoupled_
#define SAMG2_GET_WCOUPLED samg2_get_wcoupled_
#define SAMG2_SET_WFT samg2_set_wft_
#define SAMG2_GET_WFT samg2_get_wft_
#define SAMG2_SET_WLEN_SWITCHES_GALERKIN samg2_set_wlen_switches_galerkin_
#define SAMG2_GET_WLEN_SWITCHES_GALERKIN samg2_get_wlen_switches_galerkin_
#define SAMG2_SET_WRITE_CLUSTER_ID samg2_set_write_cluster_id_
#define SAMG2_GET_WRITE_CLUSTER_ID samg2_get_write_cluster_id_
#define SAMG2_SET_WTSL samg2_set_wtsl_
#define SAMG2_GET_WTSL samg2_get_wtsl_
#define SAMG2_RELEASE_INFO samg2_release_info_
#define SAMG2_VERSION_INFO samg2_version_info_
#define SAMG2_DETAILS_INFO samg2_details_info_
#endif

