openCSMP/openCSMP/lib/samg/samg2.h
// samg2_oil routines
extern "C"
SAMG_C_CALLCONV SAMG2_OIL(APPL_INT * nnu, APPL_INT * nna, APPL_INT * nsys,
          APPL_INT * ia, APPL_INT * ja, double * a, double * f, double * u,
          APPL_INT * iu, APPL_INT * ndiu, APPL_INT * ip, APPL_INT * ndip,
          APPL_INT * matrix,
          double * res_in, double * res_out, APPL_INT * ncyc_done, APPL_INT * ierr,
          APPL_INT * ifirst, double * eps, APPL_INT * ncyc,
          APPL_INT * iswtch,
          double * a_cmplx, double * g_cmplx, double * p_cmplx, double * w_avrge,
          double * chktol, APPL_INT * idump, APPL_INT * iout,
          APPL_INT * nunknown_description, APPL_INT * noil_approach, APPL_INT * noil_cyc, double * noil_preparation);
extern "C"
SAMG_C_CALLCONV XSAMG2_OIL(APPL_INT * nnu, APPL_INT * nna, APPL_INT * nsys,
          APPL_INT * ia, APPL_INT * ja, double * a, double * f, double * u,
          APPL_INT * iu, APPL_INT * ndiu, APPL_INT * ip, APPL_INT * ndip,
          APPL_INT * matrix,
          double * res_in, double * res_out, APPL_INT * ncyc_done, APPL_INT * ierr,
          APPL_INT * ifirst, double * eps, APPL_INT * ncyc,
          APPL_INT * iswtch,
          double * a_cmplx, double * g_cmplx, double * p_cmplx, double * w_avrge,
          double * chktol, APPL_INT * idump, APPL_INT * iout,
          APPL_INT * nunknown_description, APPL_INT * noil_approach, APPL_INT * noil_cyc, double * noil_preparation);

// routines for setting single parameters
// setting character strings might be a problem for some compilers
// the below variant with two arguments works, e.g., for Intel Fortran for Windows 8.x, ...
// for other compilers, add an APPL_INT *length2 ...
extern "C"
{
SAMG_C_CALLCONV SAMG2_SET_A_CMPLX_AGG_DEFAULT(double *dval);
SAMG_C_CALLCONV SAMG2_GET_A_CMPLX_AGG_DEFAULT(double *dval);
SAMG_C_CALLCONV SAMG2_SET_A_CMPLX_DEFAULT(double *dval);
SAMG_C_CALLCONV SAMG2_GET_A_CMPLX_DEFAULT(double *dval);
SAMG_C_CALLCONV SAMG2_SET_ALLOW_FILNAM_IN(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_GET_ALLOW_FILNAM_IN(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_SET_ALLOW_PRIVATE_IN(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_GET_ALLOW_PRIVATE_IN(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_SET_ALLOW_ELIM(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_GET_ALLOW_ELIM(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_SET_ALLUNS_AT_ALLPNTS(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_GET_ALLUNS_AT_ALLPNTS(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_SET_ART_TIME(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_GET_ART_TIME(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_SET_ART_TIME_CYC(double *dval);
SAMG_C_CALLCONV SAMG2_GET_ART_TIME_CYC(double *dval);
SAMG_C_CALLCONV SAMG2_SET_ART_TIME_CYC_2ND(double *dval);
SAMG_C_CALLCONV SAMG2_GET_ART_TIME_CYC_2ND(double *dval);
SAMG_C_CALLCONV SAMG2_SET_ART_TIME_SETUP(double *dval);
SAMG_C_CALLCONV SAMG2_GET_ART_TIME_SETUP(double *dval);
SAMG_C_CALLCONV SAMG2_SET_ART_TIME_SETUP_2ND(double *dval);
SAMG_C_CALLCONV SAMG2_GET_ART_TIME_SETUP_2ND(double *dval);
SAMG_C_CALLCONV SAMG2_SET_B_CMPLX(double *dval);
SAMG_C_CALLCONV SAMG2_GET_B_CMPLX(double *dval);
SAMG_C_CALLCONV SAMG2_SET_B_CMPLX_AGG_DEFAULT(double *dval);
SAMG_C_CALLCONV SAMG2_GET_B_CMPLX_AGG_DEFAULT(double *dval);
SAMG_C_CALLCONV SAMG2_SET_B_CMPLX_DEFAULT(double *dval);
SAMG_C_CALLCONV SAMG2_GET_B_CMPLX_DEFAULT(double *dval);
SAMG_C_CALLCONV SAMG2_SET_BACKUP(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_GET_BACKUP(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_SET_BLK_FILLEXP(double *dval);
SAMG_C_CALLCONV SAMG2_GET_BLK_FILLEXP(double *dval);
SAMG_C_CALLCONV SAMG2_SET_BLK_STAB(double *dval);
SAMG_C_CALLCONV SAMG2_GET_BLK_STAB(double *dval);
SAMG_C_CALLCONV SAMG2_SET_BLOCK_SCALE(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_GET_BLOCK_SCALE(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_SET_BLOCK_SCALE2(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_GET_BLOCK_SCALE2(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_SET_BLOCK_SCALE3(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_GET_BLOCK_SCALE3(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_SET_BS_AUTO_SIGN(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_GET_BS_AUTO_SIGN(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_SET_BS_MIN_BLOCK_SIZE(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_GET_BS_MIN_BLOCK_SIZE(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_SET_BS_OMP(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_GET_BS_OMP(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_ISET_BND_PARTITION_FILE(APPL_INT *istring, APPL_INT *length1);
SAMG_C_CALLCONV SAMG2_IGET_BND_PARTITION_FILE(APPL_INT *istring, APPL_INT *length1);
SAMG_C_CALLCONV SAMG2_SET_BND_PARTITION_FILE(void  *string, APPL_INT *length1);
SAMG_C_CALLCONV SAMG2_GET_BND_PARTITION_FILE(void  *string, APPL_INT *length1);
SAMG_C_CALLCONV SAMG2_SET_CHECK_ALLPNTS(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_GET_CHECK_ALLPNTS(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_SET_CHECK_ORDER(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_GET_CHECK_ORDER(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_SET_CHECK_BCSR_DUMP(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_GET_CHECK_BCSR_DUMP(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_SET_CL_CPL(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_GET_CL_CPL(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_SET_CL_ORDER(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_GET_CL_ORDER(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_SET_CL_OUTRES(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_GET_CL_OUTRES(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_SET_CL_LEVEL_DEP(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_GET_CL_LEVEL_DEP(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_SET_CL_AUTO_SIZE(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_GET_CL_AUTO_SIZE(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_SET_CL_PROC_BORDER(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_GET_CL_PROC_BORDER(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_SET_CL_QUALITY_MEASURE(double *dval);
SAMG_C_CALLCONV SAMG2_GET_CL_QUALITY_MEASURE(double *dval);
SAMG_C_CALLCONV SAMG2_SET_CL_GLOBAL_QUALITY(double *dval);
SAMG_C_CALLCONV SAMG2_GET_CL_GLOBAL_QUALITY(double *dval);
SAMG_C_CALLCONV SAMG2_SET_CL_OMP(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_GET_CL_OMP(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_SET_CL_CMK_REORDER(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_GET_CL_CMK_REORDER(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_SET_CLSOLVER_FINEST(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_GET_CLSOLVER_FINEST(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_SET_CLDENSE_CTRL(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_GET_CLDENSE_CTRL(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_SET_CONST_INT_GLK(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_GET_CONST_INT_GLK(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_SET_CONST_INT_SOL(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_GET_CONST_INT_SOL(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_SET_CNTRL_ENFORCE(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_GET_CNTRL_ENFORCE(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_SET_CNTRL_LOGFILE(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_GET_CNTRL_LOGFILE(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_SET_CNTRL_METHOD(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_GET_CNTRL_METHOD(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_SET_CNTRL_RELEASE(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_GET_CNTRL_RELEASE(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_SET_CNTRL_RES_DIFF(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_GET_CNTRL_RES_DIFF(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_SET_CNTRL_RETRY_ITER(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_GET_CNTRL_RETRY_ITER(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_SET_CNTRL_STEADY(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_GET_CNTRL_STEADY(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_SET_CONV_STOP(double *dval);
SAMG_C_CALLCONV SAMG2_GET_CONV_STOP(double *dval);
SAMG_C_CALLCONV SAMG2_SET_CORRECT_CLUSTER_INFO(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_GET_CORRECT_CLUSTER_INFO(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_SET_CSET_LASTPNT(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_GET_CSET_LASTPNT(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_SET_CSET_LESSVARS(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_GET_CSET_LESSVARS(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_SET_CSET_LONGROW(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_GET_CSET_LONGROW(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_ISET_CSET_READ(APPL_INT *istring, APPL_INT *length1);
SAMG_C_CALLCONV SAMG2_IGET_CSET_READ(APPL_INT *istring, APPL_INT *length1);
SAMG_C_CALLCONV SAMG2_SET_CSET_READ(void  *string, APPL_INT *length1);
SAMG_C_CALLCONV SAMG2_GET_CSET_READ(void  *string, APPL_INT *length1);
SAMG_C_CALLCONV SAMG2_SET_CSET_ZERODIAG(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_GET_CSET_ZERODIAG(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_SET_CSET_UNKNOWN(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_GET_CSET_UNKNOWN(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_SET_CSET_UNKNOWN1(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_GET_CSET_UNKNOWN1(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_SET_CSET_UNKNOWN2(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_GET_CSET_UNKNOWN2(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_SET_DELTA_MILU(double *dval);
SAMG_C_CALLCONV SAMG2_GET_DELTA_MILU(double *dval);
SAMG_C_CALLCONV SAMG2_SET_DENSX(double *dval);
SAMG_C_CALLCONV SAMG2_GET_DENSX(double *dval);
SAMG_C_CALLCONV SAMG2_SET_DIVERGENCE(double *dval);
SAMG_C_CALLCONV SAMG2_GET_DIVERGENCE(double *dval);
SAMG_C_CALLCONV SAMG2_SET_DIV_STOP_RULE(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_GET_DIV_STOP_RULE(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_SET_DIV_THRESHOLD(double *dval);
SAMG_C_CALLCONV SAMG2_GET_DIV_THRESHOLD(double *dval);
SAMG_C_CALLCONV SAMG2_SET_DROPTOL(double *dval);
SAMG_C_CALLCONV SAMG2_GET_DROPTOL(double *dval);
SAMG_C_CALLCONV SAMG2_SET_DROPTOL_CL(double *dval);
SAMG_C_CALLCONV SAMG2_GET_DROPTOL_CL(double *dval);
SAMG_C_CALLCONV SAMG2_SET_DROPTOL_2ND(double *dval);
SAMG_C_CALLCONV SAMG2_GET_DROPTOL_2ND(double *dval);
SAMG_C_CALLCONV SAMG2_SET_DROPTOL_SMO(double *dval);
SAMG_C_CALLCONV SAMG2_GET_DROPTOL_SMO(double *dval);
SAMG_C_CALLCONV SAMG2_SET_DUMP_APPROX_SOLUTION(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_GET_DUMP_APPROX_SOLUTION(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_SET_DUMP_CORRECTW(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_GET_DUMP_CORRECTW(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_SET_DUMP_GENERATED_SMOVEC(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_GET_DUMP_GENERATED_SMOVEC(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_SET_ECG(double *dval);
SAMG_C_CALLCONV SAMG2_GET_ECG(double *dval);
SAMG_C_CALLCONV SAMG2_SET_ECG_DEFAULT(double *dval);
SAMG_C_CALLCONV SAMG2_GET_ECG_DEFAULT(double *dval);
SAMG_C_CALLCONV SAMG2_SET_ICHOLESKY(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_GET_ICHOLESKY(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_SET_ENFORCE_FULLSMO(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_GET_ENFORCE_FULLSMO(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_SET_EPS_ABS(double *dval);
SAMG_C_CALLCONV SAMG2_GET_EPS_ABS(double *dval);
SAMG_C_CALLCONV SAMG2_SET_EPS_ACCEPT_JAC_UZAWA(double *dval);
SAMG_C_CALLCONV SAMG2_GET_EPS_ACCEPT_JAC_UZAWA(double *dval);
SAMG_C_CALLCONV SAMG2_SET_EPS_CONVERG_JAC_UZAWA(double *dval);
SAMG_C_CALLCONV SAMG2_GET_EPS_CONVERG_JAC_UZAWA(double *dval);
SAMG_C_CALLCONV SAMG2_SET_EPS_DD(double *dval);
SAMG_C_CALLCONV SAMG2_GET_EPS_DD(double *dval);
SAMG_C_CALLCONV SAMG2_SET_EPS_DIVERG_JAC_UZAWA(double *dval);
SAMG_C_CALLCONV SAMG2_GET_EPS_DIVERG_JAC_UZAWA(double *dval);
SAMG_C_CALLCONV SAMG2_SET_EPS_DIAG(double *dval);
SAMG_C_CALLCONV SAMG2_GET_EPS_DIAG(double *dval);
SAMG_C_CALLCONV SAMG2_SET_EPS_LSQ(double *dval);
SAMG_C_CALLCONV SAMG2_GET_EPS_LSQ(double *dval);
SAMG_C_CALLCONV SAMG2_SET_ETR(double *dval);
SAMG_C_CALLCONV SAMG2_GET_ETR(double *dval);
SAMG_C_CALLCONV SAMG2_SET_ETR_DEFAULT(double *dval);
SAMG_C_CALLCONV SAMG2_GET_ETR_DEFAULT(double *dval);
SAMG_C_CALLCONV SAMG2_SET_ETR2_SMO(double *dval);
SAMG_C_CALLCONV SAMG2_GET_ETR2_SMO(double *dval);
SAMG_C_CALLCONV SAMG2_SET_EWT(double *dval);
SAMG_C_CALLCONV SAMG2_GET_EWT(double *dval);
SAMG_C_CALLCONV SAMG2_SET_EWT_DEFAULT(double *dval);
SAMG_C_CALLCONV SAMG2_GET_EWT_DEFAULT(double *dval);
SAMG_C_CALLCONV SAMG2_SET_FACTOR_APP_VAR(double *dval);
SAMG_C_CALLCONV SAMG2_GET_FACTOR_APP_VAR(double *dval);
SAMG_C_CALLCONV SAMG2_SET_FACTOR_QUASI_RES(double *dval);
SAMG_C_CALLCONV SAMG2_GET_FACTOR_QUASI_RES(double *dval);
SAMG_C_CALLCONV SAMG2_SET_FACTOR_RES_VAR(double *dval);
SAMG_C_CALLCONV SAMG2_GET_FACTOR_RES_VAR(double *dval);
SAMG_C_CALLCONV SAMG2_SET_FACTOR_MATRIX_SCALE(double *dval);
SAMG_C_CALLCONV SAMG2_GET_FACTOR_MATRIX_SCALE(double *dval);
SAMG_C_CALLCONV SAMG2_SET_FACTOR_SOL_JAC_UZAWA(double *dval);
SAMG_C_CALLCONV SAMG2_GET_FACTOR_SOL_JAC_UZAWA(double *dval);
SAMG_C_CALLCONV SAMG2_ISET_FILNAM(APPL_INT *istring, APPL_INT *length1);
SAMG_C_CALLCONV SAMG2_IGET_FILNAM(APPL_INT *istring, APPL_INT *length1);
SAMG_C_CALLCONV SAMG2_SET_FILNAM(void  *string, APPL_INT *length1);
SAMG_C_CALLCONV SAMG2_GET_FILNAM(void  *string, APPL_INT *length1);
SAMG_C_CALLCONV SAMG2_ISET_FILNAM_DUMPSOL(APPL_INT *istring, APPL_INT *length1);
SAMG_C_CALLCONV SAMG2_IGET_FILNAM_DUMPSOL(APPL_INT *istring, APPL_INT *length1);
SAMG_C_CALLCONV SAMG2_SET_FILNAM_DUMPSOL(void  *string, APPL_INT *length1);
SAMG_C_CALLCONV SAMG2_GET_FILNAM_DUMPSOL(void  *string, APPL_INT *length1);
SAMG_C_CALLCONV SAMG2_ISET_FILNAM_DUMP(APPL_INT *istring, APPL_INT *length1);
SAMG_C_CALLCONV SAMG2_IGET_FILNAM_DUMP(APPL_INT *istring, APPL_INT *length1);
SAMG_C_CALLCONV SAMG2_SET_FILNAM_DUMP(void  *string, APPL_INT *length1);
SAMG_C_CALLCONV SAMG2_GET_FILNAM_DUMP(void  *string, APPL_INT *length1);
SAMG_C_CALLCONV SAMG2_ISET_FILNAM_UZAWA(APPL_INT *istring, APPL_INT *length1);
SAMG_C_CALLCONV SAMG2_IGET_FILNAM_UZAWA(APPL_INT *istring, APPL_INT *length1);
SAMG_C_CALLCONV SAMG2_SET_FILNAM_UZAWA(void  *string, APPL_INT *length1);
SAMG_C_CALLCONV SAMG2_GET_FILNAM_UZAWA(void  *string, APPL_INT *length1);
SAMG_C_CALLCONV SAMG2_SET_FLEX_PCG_LITE(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_GET_FLEX_PCG_LITE(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_SET_FORCE_ACCEL(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_GET_FORCE_ACCEL(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_SET_FORCE_ACCEL_2ND(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_GET_FORCE_ACCEL_2ND(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_SET_FULL_PIVOTING(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_GET_FULL_PIVOTING(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_SET_FULL_SETUP(double *dval);
SAMG_C_CALLCONV SAMG2_GET_FULL_SETUP(double *dval);
SAMG_C_CALLCONV SAMG2_SET_G_CMPLX_AGG_DEFAULT(double *dval);
SAMG_C_CALLCONV SAMG2_GET_G_CMPLX_AGG_DEFAULT(double *dval);
SAMG_C_CALLCONV SAMG2_SET_G_CMPLX_DEFAULT(double *dval);
SAMG_C_CALLCONV SAMG2_GET_G_CMPLX_DEFAULT(double *dval);
SAMG_C_CALLCONV SAMG2_SET_GALERKIN_TIMER(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_GET_GALERKIN_TIMER(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_SET_GLK_MULT_ZEROS(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_GET_GLK_MULT_ZEROS(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_SET_GMAX_MULTIPASS(double *dval);
SAMG_C_CALLCONV SAMG2_GET_GMAX_MULTIPASS(double *dval);
SAMG_C_CALLCONV SAMG2_SET_IAGGREGATION_PROFILE(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_GET_IAGGREGATION_PROFILE(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_SET_IAGGREGATION(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_GET_IAGGREGATION(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_SET_IALL_SMO(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_GET_IALL_SMO(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_SET_IAUTO_OMEGA_JACOBI(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_GET_IAUTO_OMEGA_JACOBI(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_SET_IAUTO_OMEGA_SMOAGG(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_GET_IAUTO_OMEGA_SMOAGG(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_SET_IAUTO_STOP(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_GET_IAUTO_STOP(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_SET_IDUMP_SEQUENCE_START(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_GET_IDUMP_SEQUENCE_START(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_SET_IDUMP_SEQUENCE_END(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_GET_IDUMP_SEQUENCE_END(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_SET_ISTAB_CG(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_GET_ISTAB_CG(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_SET_IELASTICITY_PROFILE(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_GET_IELASTICITY_PROFILE(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_SET_IELASTICITY(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_GET_IELASTICITY(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_SET_IESTIM_SPECT_RADIUS(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_GET_IESTIM_SPECT_RADIUS(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_SET_IESTIM_SMOOTH_NIT(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_GET_IESTIM_SMOOTH_NIT(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_SET_INIT_RES_TREATMENT(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_GET_INIT_RES_TREATMENT(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_SET_IPRNT_RES_ACCURACY(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_GET_IPRNT_RES_ACCURACY(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_SET_ISMO2DFL(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_GET_ISMO2DFL(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_SET_ISMOAGG_AGGRESSIVE(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_GET_ISMOAGG_AGGRESSIVE(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_SET_ISMOAGG_OVERCORRECTION(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_GET_ISMOAGG_OVERCORRECTION(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_SET_ISMOAGG_OPTIM(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_GET_ISMOAGG_OPTIM(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_SET_ISMOAGG_BLOCK_TYP(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_GET_ISMOAGG_BLOCK_TYP(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_SET_ISMOAGG_COMPRESSION(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_GET_ISMOAGG_COMPRESSION(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_SET_ISMOAGG_FILTER_TYP(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_GET_ISMOAGG_FILTER_TYP(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_SET_ISMOAGG_SMOOTH_TYP(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_GET_ISMOAGG_SMOOTH_TYP(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_SET_ISMOAGG_SMOOTH_NIT(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_GET_ISMOAGG_SMOOTH_NIT(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_SET_ISMOAGG_SMOOTH_1LEV(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_GET_ISMOAGG_SMOOTH_1LEV(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_SET_ISMOAGG_SMOOTH_NLEV(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_GET_ISMOAGG_SMOOTH_NLEV(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_SET_IB_CMPLX(double *dval);
SAMG_C_CALLCONV SAMG2_GET_IB_CMPLX(double *dval);
SAMG_C_CALLCONV SAMG2_SET_IB_CMPLX_AGG_DEFAULT(double *dval);
SAMG_C_CALLCONV SAMG2_GET_IB_CMPLX_AGG_DEFAULT(double *dval);
SAMG_C_CALLCONV SAMG2_SET_IB_CMPLX_DEFAULT(double *dval);
SAMG_C_CALLCONV SAMG2_GET_IB_CMPLX_DEFAULT(double *dval);
SAMG_C_CALLCONV SAMG2_SET_IBGS_PIVOT(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_GET_IBGS_PIVOT(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_SET_ICASE_JAC_UZAWA(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_GET_ICASE_JAC_UZAWA(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_SET_ISTATISTICS_SMOVEC(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_GET_ISTATISTICS_SMOVEC(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_SET_ICHECK_SMOINT(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_GET_ICHECK_SMOINT(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_SET_ICOLOR_OMP(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_GET_ICOLOR_OMP(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_SET_IORDERED_OMP(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_GET_IORDERED_OMP(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_SET_ICRITS(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_GET_ICRITS(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_SET_IDTEST_UZAWA(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_GET_IDTEST_UZAWA(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_SET_IHUGE(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_GET_IHUGE(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_SET_IJAC_UZAWA(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_GET_IJAC_UZAWA(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_SET_ILU4ALLSCHWARZ(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_GET_ILU4ALLSCHWARZ(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_SET_ILU_SPEED(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_GET_ILU_SPEED(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_SET_IMPLDO_READ_WRITE_LEN(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_GET_IMPLDO_READ_WRITE_LEN(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_SET_INFO_KEEPMEM(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_GET_INFO_KEEPMEM(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_SET_INNER_ACCEL(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_GET_INNER_ACCEL(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_SET_IODUMP(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_GET_IODUMP(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_ISET_IOFILE_OPTA(APPL_INT *istring, APPL_INT *length1);
SAMG_C_CALLCONV SAMG2_IGET_IOFILE_OPTA(APPL_INT *istring, APPL_INT *length1);
SAMG_C_CALLCONV SAMG2_SET_IOFILE_OPTA(void  *string, APPL_INT *length1);
SAMG_C_CALLCONV SAMG2_GET_IOFILE_OPTA(void  *string, APPL_INT *length1);
SAMG_C_CALLCONV SAMG2_ISET_IOFORM(APPL_INT *istring, APPL_INT *length1);
SAMG_C_CALLCONV SAMG2_IGET_IOFORM(APPL_INT *istring, APPL_INT *length1);
SAMG_C_CALLCONV SAMG2_SET_IOFORM(void  *string, APPL_INT *length1);
SAMG_C_CALLCONV SAMG2_GET_IOFORM(void  *string, APPL_INT *length1);
SAMG_C_CALLCONV SAMG2_SET_IOGRID(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_GET_IOGRID(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_SET_IOMOVIE(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_GET_IOMOVIE(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_SET_IOSCRATCH_DEFAULT(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_GET_IOSCRATCH_DEFAULT(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_SET_IOUNIT_OPTA(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_GET_IOUNIT_OPTA(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_SET_IPASS_MAX_SET(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_GET_IPASS_MAX_SET(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_SET_IRESTRICTION_OPENMP(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_GET_IRESTRICTION_OPENMP(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_SET_IPRESSURE_UZAWA(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_GET_IPRESSURE_UZAWA(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_SET_IPROFILE_GEOMETRIC(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_GET_IPROFILE_GEOMETRIC(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_SET_ISAT_UZAWA(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_GET_ISAT_UZAWA(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_SET_ISET_VIO_DD(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_GET_ISET_VIO_DD(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_SET_ISSTEP_UZAWA(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_GET_ISSTEP_UZAWA(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_SET_ISTEP1CASE_UZAWA(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_GET_ISTEP1CASE_UZAWA(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_SET_ISTEERING(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_GET_ISTEERING(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_SET_ISWIT3_USER(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_GET_ISWIT3_USER(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_SET_ITER_CHECK(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_GET_ITER_CHECK(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_SET_ITER_MATRIX_SCALE(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_GET_ITER_MATRIX_SCALE(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_SET_ITER_PRE(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_GET_ITER_PRE(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_SET_ITMAX_CONV(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_GET_ITMAX_CONV(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_SET_ITRACE_AMGMAIN(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_GET_ITRACE_AMGMAIN(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_SET_ITRACELEVEL(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_GET_ITRACELEVEL(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_SET_ITRACE_CLSOL(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_GET_ITRACE_CLSOL(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_SET_ITRACE_CLDENSE(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_GET_ITRACE_CLDENSE(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_SET_ITRACE_DIVSTOP(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_GET_ITRACE_DIVSTOP(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_SET_ITRACE_JAC_UZAWA(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_GET_ITRACE_JAC_UZAWA(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_SET_ITRACE_MK_REGULAR(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_GET_ITRACE_MK_REGULAR(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_SET_ITRACE_MATRIX_MODE(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_GET_ITRACE_MATRIX_MODE(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_SET_ITRACE_MATRIX_STORAGE(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_GET_ITRACE_MATRIX_STORAGE(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_SET_ITRACE_SCHWARZ(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_GET_ITRACE_SCHWARZ(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_SET_ITRACE_SMO(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_GET_ITRACE_SMO(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_SET_ITRACE_SOL(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_GET_ITRACE_SOL(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_SET_ITRACE_SPLIT(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_GET_ITRACE_SPLIT(APPL_INT *ival);
SAMG_C_CALLCONV SAMG2_SET_ITRACE_UZAWA(APPL_INT *ival);
